<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  
  <title>OmegaT, το δωρεάν εργαλείο μεταφραστικής μνήμης</title>
  <meta name="generator" content="screem 0.10.2" />
  
  <meta http-equiv="Content-Type" content="text/html;charset=UTF-8" />
  
  <meta name="keywords" content="μεταφραστική μνήμη, ΜΜ, μετάφραση υποβοηθούμενη από υπολογιστή, CAT, GPL, ανοιχτός κώδικας" />

  
<link rel="stylesheet" type="text/css" href="../../config/howto.css" />

</head>

<?php include '../../config/versions.txt'; ?>

<body>

<div id="container">
			
<div id="banner">

<h1>OmegaT</h1>

<p>Το δωρεάν (GPL) εργαλείο μεταφραστικής μνήμης</p>

</div>

<div id="content">

<h2>Οδηγός τού OmegaT:  Μετάφραση του OmegaT στην γλώσσα σας</h2>


<h3>Μετάφραση: γενικές παρατηρήσεις</h3>


<p>Παρακάτω, όπου χρησιμοποιούμε α΄ πληθυντικό αναφερόμαστε στην ομάδα έργου. Η ομάδα έργου τού OmegaT δεν είναι εταιρεία ούτε επίσημο νομικό πρόσωπο· είναι απλώς μια ομάδα εθελοντών που έχουν αναμιχθεί στο έργο τού OmegaT.</p>


<p>Το OmegaT είναι ένα δωρεάν, ανοιχτού κώδικα πρόγραμμα μεταφραστικής μνήμης. Το περιβάλλον χρήστη και η τεκμηρίωση αρχικά γράφτηκαν στην Αγγλική. Επειδή το πρόγραμμα προορίζεται για μεταφραστές σε όλο τον κόσμο και όχι μόνο σε αγγλόφωνες χώρες, χρειάζεται η τεκμηρίωση (και, αν είναι δυνατό, το ίδιο το πρόγραμμα) να διατίθενται και σε άλλες γλώσσες. Ωστόσο, επειδή το πρόγραμμα δεν πωλείται αλλά διατίθεται δωρεάν, δεν υπάρχουν χρήματα για αμοιβές μεταφραστών. Αντ' αυτού, όσοι έχουμε αναμιχθεί στο έργο τού OmegaT ελπίζουμε ότι θα μας παρασχεθούν μεταφράσεις πρώτα και κύρια από μεταφραστές που έχουν δοκιμάσει το OmegaT και έχουν πειστεί ότι είναι χρήσιμο για την μεταφραστική κοινότητα.</p>


<h3>Το έργο τής μετάφρασης</h3>


<p>Την ώρα που γράφονται αυτές οι γραμμές υπάρχουν προς μετάφραση τα εξής:</p>


<p>

* Το περιβάλλον χρήστη (μενού κτλ.)<br/>

* Το εγχειρίδιο χρήσης (εξόχως λεπτομερές)<br/>

* Ο Οδηγός Άμεσης Εκκίνησης (μια σύντομη εισαγωγή στην χρήση τού OmegaT)<br/>

* Το αρχείο readme (ένα έγγραφο με γενικές πληροφορίες για το OmegaT)<br/>

* Οι ιστοσελίδες τού OmegaT (σαν αυτήν που διαβάζετε τώρα)

</p>


<p>Οι μεταφραστές μπορούν να αναλάβουν όσο όγκο δουλειάς επιθυμούν. Συγκεκριμένα, το κυρίως εγχειρίδιο χρήσης ίσως χρειαστεί έως δύο εβδομάδες για να μεταφραστεί, ενώ ίσως επιθυμούν να μοιραστούν την δουλειά αυτή περισσότεροι από έναν μεταφραστές.</p>

<h3>Διαδικασία</h3>

<p>1. Επικοινωνήστε με τον <a href="mailto:jean.christophe.helary@gmail.com">συντονιστή τής εντοπίευσης</a>, ο οποίος θα μπορέσει να σας ενημερώσει για ζητήματα που αφορούν ειδικά στην γλώσσα σας.</p>


<p>2. Γίνετε μέλος τής <a href="http://tech.groups.yahoo.com/group/omegat/">ομάδας χρηστών τού OmegaT</a> (γνωστής και ως "OmT"). Κατά την εγγραφή σας θα χρειαστεί να στείλετε ένα σύντομο μήνυμα στους επόπτες τής ομάδας, για να καταλάβουν ότι είστε πραγματικός χρήστης και όχι  μηχανή.</p>

<p>Αφού γίνετε μέλος, επισκεφθείτε το <a href="http://tech.groups.yahoo.com/group/omegat/database">Πρόγραμμα Εντοπίευσης του OmegaT</a>. Αυτό το πρόγραμμα δείχνει τι μεταφραστική/εντοπιευτική δουλειά έχει ήδη γίνει για το OmegaT και τι δουλειά βρίσκεται σε εξέλιξη. Αν ένα κατάλληλο τμήμα δουλειάς για την γλώσσα σας δεν έχει ακόμη αναληφθεί, μπορείτε να κάνετε μια καταχώριση στο πρόγραμμα, για να δείξετε ότι την έχετε αναλάβει εσείς. Σκοπός τού προγράμματος είναι να αποφευχθεί το φαινόμενο να εργάζονται δύο ή περισσότεροι μεταφραστές στο ίδιο υλικό χωρίς να το γνωρίζουν (δηλ. αποφυγή τού διπλού κόπου). <strong>Για να αποφευχθεί το φαινόμενο να εργάζονται δύο ή περισσότεροι μεταφραστές τής ίδιας γλώσσας παράλληλα, είναι πολύ σημαντικό να κάνετε μια καταχώριση στο πρόγραμμα εντοπίευσης όταν αρχίσετε να κάνετε μια μετάφραση.</strong></p>

<p>3. Αν και δεν είναι απαραίτητο, συνιστούμε να γίνετε μέλος και στην <a href="https://lists.sourceforge.net/lists/listinfo/omegat-l10n">λίστα αλληλογραφίας εντοπιευτών τού OmegaT</a> (γνωστής και ως "OmT-l10n").</p>

<p>4. Κατεβάστε τα προς μετάφραση αρχεία, ένα από τα δύο πακέτα: <?php $link='<a
href="http://sourceforge.net/projects/omegat/files/Other%20-%20Localization%20projects/OmegaT%20'.$standard_name.'/OmegaT_'.$standard_number.'_L10N_Full.zip"
>';
$endlink='</a>';?>
<?php echo $link ?>"Full" package<?php echo $endlink ?> or the <?php $link='<a
href="http://sourceforge.net/projects/omegat/files/Other%20-%20Localization%20projects/OmegaT%20'.$standard_name.'/OmegaT_'.$standard_number.'_L10N_Minimal.zip"
>';
$endlink='</a>';?>
<?php echo $link ?>"Minimal" package<?php echo $endlink ?>.</p>

<p>Το πλήρες πακέτο περιέχει το εγχειρίδιο χρήσης, τον Οδηγό Άμεσης Εκκίνησης, το πακέτο των πόρων τού περιβάλλοντος χρήστη και το αρχείο readme. Το ελάχιστο πακέτο περιέχει τα ίδια αρχεία με το πλήρες πακέτο εκτός από το κυρίως εγχειρίδιο χρήσης. Δεν χρειάζεται να μεταφράσετε ένα πακέτο ολόκληρο· μπορείτε, για παράδειγμα, να μεταφράσετε μόνο το περιβάλλον χρήστη (Bundle.properties) ή μόνο τον Οδηγό Άμεσης Εκκίνησης.</p>

<p>Αν θέλετε να μεταφράσετε τις ιστοσελίδες τού OmegaT, κατεβάσετε το <a href="http://www.omegat.org/resources/omt_website.zip">πακέτο εντοπίευσης ιστοχώρου</a>. (Σημείωση: αυτά είναι τα αρχεία τής Αγγλικής. Αν προτιμάτε να μεταφράσετε από άλλη γλώσσα στην οποία έχει ήδη εντοπιευτεί το OmegaT, επικοινωνήστε με τον <a href="mailto:mailto:lin4trans@users.sourceforge.net">διευθυντή τού ιστοχώρου τού OmegaT</a>.)</p>

<p>Ο ιστοχώρος τού OmegaT περιλαμβάνει αρχεία μορφής HTML και, από το 2011, PHP. Για να μεταφράσετε τα αρχεία PHP στο OmegaT, πρέπει να εγγράψετε την επέκταση .php στο φίλτρο XHTML, ως εξής:</p>

<p>Επιλογές &gt; Φίλτρα Αρχείου &gt; Επιλέξτε "XHTML files" &gt; Επεξεργασία &gt; Πρόσθεση &gt; Πληκτρολογήστε "*.php" στην στήλη "Μοτίβο Αρχείου Προέλευσης".</p>

<p>5. Ίσως υπάρχουν παλιότερες εκδόσεις τής τεκμηρίωσης ή/και των μεταφραστικών μνημών (αρχεία TMX) για την γλώσσα σας, τα οποία θα σας είναι χρήσιμα για την μετάφραση. Μπορείτε να κατεβάσετε ένα αποθετήριο τέτοιων αρχείων από τον ιστοχώρο τού OmegaT, στο www.omegat.org/resources/tmx_repository.zip. Επίσης, αξίζει να ρωτήσετε στην <a href="https://lists.sourceforge.net/lists/listinfo/omegat-l10n">λίστα εντοπιευτών</a> (OmT-l10n) αν έχει κανείς υλικό αναφοράς που ίσως να μπορούσε να διευκολύνει το έργο σας.</p>

<p>6. Μεταφράστε τα αρχεία που έχετε επιλέξει. Είναι περιττό να σημειώσουμε ότι θα προτιμούσαμε να χρησιμοποιήσετε το OmegaT για την εντοπίευση του OmegaT. Ωστόσο, μπορείτε να χρησιμοποιήσετε άλλο πρόγραμμα, αν το επιθυμείτε.</p>

<p>Αποσυμπιέστε τις αρχειοθήκες zip με πακέτο που κατεβάσατε (πλήρες ή ελάχιστο). Αφού αποσυμπιεστούν, τα προς εντοπίευση αρχεία τού OmegaT είναι έτοιμα για χρήση σε ένα έργο τού OmegaT. Δεν χρειάζεται να δημιουργήσετε ένα έργο τού OmegaT όπως θα κάνατε κανονικά.</p>

<p>Έχετε πλήρη ελευθερία στο πώς μεταφράζετε. Μπορείτε να τροποποιήσετε, να διορθώσετε, να προσθέσετε ή να διαγράψετε πληροφορίες όπως κρίνετε κατάλληλο. Αν έχετε ερωτήσεις, ο καλύτερος παραλήπτης τους είναι η <a href="https://lists.sourceforge.net/lists/listinfo/omegat-l10n">λίστα OmT-l10n</a>.</p>

<p>Αν το έγγραφο που μεταφράζετε περιέχει το κείμενο της άδειας GPL (GNU Public License) ή της GFDL (GNU Free Documentation License), <strong>μην</strong> το μεταφράσετε. Πρώτον, μόνο το πρωτότυπο στην Αγγλική είναι νομικά έγκυρο. Μπορεί να δοθεί μετάφραση, αλλά μόνο για πληροφόρηση, χωρίς νομική εγκυρότητα. Δεύτερον, αν η γλώσσα σας δεν είναι πολύ σπάνια, θα υπάρχει ήδη μετάφραση για τα κείμενα αυτά. Αν ψάξετε στον Ιστό είναι πολύ πιθανό να βρείτε τις μεταφράσεις.</p>

<p>Διατηρήστε τα μεταφράσματα στην ίδια μορφή με τα πρωτότυπα. Η μορφή διατηρείται αυτόματα, αν χρησιμοποιήσετε το OmegaT. Είμαστε ευγνώμονες προς όλους τους μεταφραστές, αλλά η δουλειά μας θα είναι πολύ ευκολότερη αν λάβουμε τα αρχεία στην αρχική τους μορφή (και όχι ως αρχεία Word, για παράδειγμα).</p>

<p>7. Δοκιμάστε την μετάφρασή σας (προαιρετικά).</p>

<p>Για να δοκιμάσετε το περιβάλλον χρήστη:</p>

<p>Εκκινήστε το OmegaT από την γραμμή εντολών (παράθυρο του MS-DOS) με τις εξής εντολές (αν δεν ξέρετε πώς γίνεται αυτό, ανατρέξτε στο εγχειρίδιο χρήσης τού OmegaT)</p>

<p>     cd [πλήρης διαδρομή για το OmegaT]<br/>

&nbsp; &nbsp; &nbsp;java -jar OmegaT.jar resource-bundle=[name of bundle with full path]</p>

<p>όπου [πλήρης διαδρομή για το OmegaT] είναι η πλήρης διαδρομή προς τον φάκελο που περιέχει το πρόγραμμα του OmegaT και [όνομα πακέτου με πλήρη διαδρομή] είναι το όνομα της μετάφρασής σας του πακέτου πόρων (bundle_en.properties, εκτός αν αλλάξατε το όνομα), συμπεριλαμβανομένης της πλήρους διαδρομής προς τη θέση του.</p>

<p>Για να δοκιμάσετε την εμφάνιση του Οδηγού Άμεσης Εκκίνησης:</p>

<p> Στον φάκελο /docs/ τού OmegaT δημιουργήστε έναν υποφάκελο με τον κωδικό ISO τής γλώσσας τού λειτουργικού σας συστήματος (μετονομάστε προσωρινά τον υπάρχοντα φάκελο, αν υπάρχει) και αντιγράψτε το εγχειρίδιο σε αυτόν τον φάκελο. Μετά, εκκινήστε το OmegaT κανονικά. (Αν έχετε κάνει μετάφραση σε γλώσσα άλλη από εκείνη τού λειτουργικού σας συστήματος, δείτε παρακάτω, την ενότητα "Πώς χειρίζεται το OmegaT τις εντοπιευμένες εκδόσεις".)</p>

<p>8. Δημιουργήστε ένα στιγμιότυπο του OmegaT στην γλώσσα σας. Αυτό είναι επίσης προαιρετικό, αλλά αν μπορέσατε να εκκινήσετε το OmegaT με το εντοπιευμένο πακέτο σας (δείτε παραπάνω), θα βελτιώσει την ποιότητα του μεταφράσματός σας. Για να λάβετε ένα στιγμιότυπο, εκκινήστε το OmegaT και ανοίξτε ένα παράθυρο κατάλληλο για στιγμιότυπο, όπως το πλαίσιο διαλόγου "Δημιουργία νέου έργου" με τις συνηθισμένες διαδρομές να φαίνονται.</p>

<p>Επιλέξτε τον τύπο αρχείου .png</p>

<p>Ονομάστε το αρχείο NewImage.png</p>

<p>9. Παραδώστε το αρχείο σας στον συντονιστή τής εντοπίευσης, ο οποίος θα το δώσει στην ομάδα ανάπτυξης, για να το περιλάβουν στην επόμενη κυκλοφορία τού OmegaT. Αν χρησιμοποιήσατε το OmegaT ή άλλο εργαλείο CAT για την μετάφραση, στείλτε και την μεταφραστική μνήμη (αρχείο TMX) μαζί με το μετάφρασμα. Έτσι, θα είναι πολύ ευκολότερη η ενημέρωση της μετάφρασής σας στο μέλλον. Παρακαλούμε ΜΗΝ παραδώσετε όλο το αρχείο έργου τού OmegaT στον συντονιστή τής εντοπίευσης (δεν χρειάζεται να λάβει περισσότερα από ένα αντίγραφα του έργου ). Αντ' αυτού, δημιουργήστε δύο χωριστά αρχεία .zip ή tar.gz, το ένα με τα έγγραφα αφίξεως μόνο και το άλλο με τα αρχεία tmx.</p>

<p>10. Μην ξεχάσετε να ενημερώσετε το Πρόγραμμα Εντοπίευσης του OmegaT (δείτε το Βήμα 2 τής διαδικασίας), για να δείξετε ότι έχετε ολοκληρώσει την μετάφραση ενός εγγράφου / μιας έκδοσης. Ομοίως, αν για κάποιον λόγο εγκαταλείψετε την μετάφραση, ενημερώστε την καταχώρισή σας στο πρόγραμμα κατάλληλα. Έτσι, το σχετικό έγγραφο θα αποδεσμευτεί και θα μπορεί να το αναλάβει άλλος μεταφραστής. Αν εγκαταλείψετε προτού ολοκληρώσετε την μετάφραση, δημιουργήστε τα αρχεία tmx για ό,τι έχετε κάνει και στείλτε τα με στον συντονιστή τής εντοπίευσης.</p>

<h3>Πώς χειρίζεται το OmegaT τις εντοπιευμένες εκδόσεις</h3>

<p>Την ώρα που γράφονται αυτές οι γραμμές το OmegaT εντοπίζει την γλώσσα τού λειτουργικού συστήματος που χρησιμοποιείτε. Κατόπιν, φορτώνει το περιβάλλον χρήστη ή/και το εγχειρίδιο χρήσης σε αυτήν την γλώσσα, αν υπάρχει. Αν ένα περιβάλλον χρήστη ή εγχειρίδιο χρήσης δεν υπάρχει στην γλώσσα τού λειτουργικού σας συστήματος, το OmegaT εμφανίζει τα εμφανίζει στην Αγγλική.</p>

<p>Αν το OmegaT περιέχει μια γλώσσα την οποία θα θέλατε να χρησιμοποιήσετε αν και δεν είναι η γλώσσα τού λειτουργικού σας συστήματος, μπορείτε να αναγκάσετε το OmegaT να την χρησιμοποιήσει αλλάζοντας την εντολή εκκίνησης. Η εντολή εκκίνησης μπορεί να βρεθεί στο αρχείο "omegat" ή/και στο "omegat.bat" στον φάκελο που περιέχει το πρόγραμμα. Η συνήθης εντολή είναι:      java -jar OmegaT.jar</p>

<p> Αλλάξτε την προσθέτοντας την επιλογή γλώσσας χρήστη και τον αντίστοιχο κωδικό γλώσσας, π.χ. για την Γαλλική:</p>

<p> &nbsp; &nbsp; java -Duser.language=fr -jar OmegaT.jar</p>

<h3>Σχετικά με τα πνευματικά δικαιώματα</h3>

<p>Ο κύριος όγκος τής τεκμηρίωσης του OmegaT διατίθεται με άδεια επαναχρησιμοποίησης υπό την άδεια GNU Public License (GPL) ή GNU Free Documentation License (GFDL).  Οι ιστοσελίδες δεν διατίθενται με άδεια επαναχρησιμοποίησης. Τίποτε από αυτά δεν χρειάζεται να σας απασχολήσει, εκτός αν έχετε ειδικό ενδιαφέρον για θέματα πνευματικών δικαιωμάτων. Θα γίνει αναφορά στο όνομά σας ως δημιουργού τής μετάφρασής σας και ως ενός από τους κατόχους των πνευματικών δικαιωμάτων.</p>

<p>Copyright Marc Prior 2009-2011</p>

</div>

<div id="footer"><a href="http://sourceforge.net"><img src="http://sourceforge.net/sflogo.php?group_id=68187&amp;type=1" alt="Λογότυπο του SourceForge.net" height="31" width="88" /></a><br />

<a href="http://validator.w3.org/check?uri=referer"><img src="../../images/xhtml.png" alt="Έγκυρη XHTML" /></a> <a href="http://jigsaw.w3.org/css-validator/check/referer"><img src="../../images/css.png" alt="Έγκυρη XHTML" /></a>
	</div>

</div>

</body></html>
