<div class="container">

<h2>Gu&iacute;a de compatibilidade de OmegaT</h2>


<p>Esta gu&iacute;a fala da compatibilidade de OmegaT con outros produtos de software.</p>

<h3>Comentarios xerais</h3>

<p>Dado que &eacute; un procedemento habitual no mundo da traduci&oacute;n recibir e enviar os textos en formato dixital, as persoas que empregan OmegaT est&aacute;n interesadas na s&uacute;a compatibilidade con outros produtos de software. Nesta gu&iacute;a atopar&aacute; informaci&oacute;n sobre este tema.</p>

<p>Observaci&oacute;n xeral: en poucas ocasi&oacute;ns se pode falar da \xABcompatibilidade\xBB como unha cuesti&oacute;n de branco ou negro, de \xABsi\xBB ou \xABnon\xBB. Cando o vendedor dun software asegura que o seu produto &eacute; compatible con outro software, case nunca se trata dunha compatibilidade do 100 %. En cambio, cando dous produtos non son compatibles, en moitas ocasi&oacute;ns &eacute; posible atopar m&eacute;todos para que poidan traballar xuntos. A cuesti&oacute;n &eacute; se estes procesos merecen a pena en relaci&oacute;n ao esforzo necesario e o resultado obtido, algo que variar&aacute; para cada persoa. Dito doutra forma, a \xABcompatibilidade\xBB non s&oacute; est&aacute; relacionada cos produtos, sen&oacute;n tam&eacute;n coa forma de traballar.<br/>

</p>


<h3>Sistemas operativos</h3>

<p>OmegaT funciona en calquera sistema operativo no que unha versi&oacute;n adecuada do Java Runtime Environment (JRE) poida ser instalada. Nestes momentos isto incl&uacute;e todas as versi&oacute;ns de Microsoft Windows a partir de Windows 98, macOS e a maior&iacute;a das distribuci&oacute;ns de Linux. </p>

<h3>Textos de orixe (ficheiros para traducir)</h3>

<p>No manual de usuario de OmegaT poder&aacute; atopar unha lista actualizada de todos os formatos de ficheiro compatibles. <b>Non</b> &eacute; unha lista exhaustiva de todos os formatos de ficheiro compatibles con OmegaT, sen&oacute;n que est&aacute; limitada a aqueles que resultan especialmente interesantes para os usuarios t&iacute;picos.</p>

<ul>

  <li>
    
    <p><strong>Microsoft Office 2007-2010 (Word, Excel, PowerPoint 2007-2010); Office Open XML:</strong></p>

    <p>OmegaT pode traballar cos formatos actuais de Microsoft Office directamente, sen a necesidade de convertelos a outros.</p>

<p>Os formatos de ficheiro de Microsoft Office 2007-2010 (tam&eacute;n co&ntilde;ecidos como Office Open XML e te&ntilde;en as extensi&oacute;ns .docx, .xlsx e .pptx) son totalmente diferentes dos formatos de Office 97-2003 aos que substit&uacute;en. De feito, a s&uacute;a estrutura &eacute; moi similar &aacute; dos ficheiros de OpenOffice.org: tr&aacute;tase de ficheiros zip que conte&ntilde;en varios ficheiros, e os ficheiros que conte&ntilde;en o texto est&aacute;n baseados no formato XML. Isto facilita a compatibilidade das ferramentas de traduci&oacute;n asistida e permite editalos de forma directa. &Eacute; posible procesar os formatos de ficheiro Microsoft Office 2007-2010 de forma directa en OmegaT. Pode atopar m&aacute;is informaci&oacute;n ao respecto <a href="./docx.html">aqu&iacute;</a>.</p>
    
    <p>Os usuarios de Microsoft Office que inda non te&ntilde;en a versi&oacute;n 2007 (ou unha posterior) poden empregar un complemento gratu&iacute;to para converter ficheiros entre Office Open XML e Microsoft Office 98-2003. Microsoft ofrece este complemento de forma gratu&iacute;ta <a href="http://www.download.com/Microsoft-Open-XML-Converter/3000-18483_4-146736.html">aqu&iacute;</a>. O convertedor est&aacute; dispo&ntilde;ible para Windows e Mac.</p>
  
    <p>Tam&eacute;n pode facer conversi&oacute;ns de Office Open XML a Open Document Format e &aacute; inversa empregando o convertedor ODF, que pode atopar <a href="http://odf-converter.sourceforge.net/download.html">aqu&iacute;</a>. Esta ferramenta require unha versi&oacute;n de MS Office (XP/2003/2007).<br/></p>

    <p>Os usuarios de macOS poden facer conversi&oacute;ns de Office Open XML a Open Document Format e &aacute; inversa empregando <a href="http://www.neooffice.org/">NeoOffice</a>.</p>

    <p>Os usuarios de Linux poden empregar esta versi&oacute;n do <a href="http://www.oooninja.com/2008/01/convert-openxml-docx-etc-in-linux-using.html">convertedor</a> independente para facer conversi&oacute;ns entre Office Open XML e Open Document Format.</p>

    <p>As versi&oacute;ns recentes de OpenOffice.org poden converter entre Microsoft Office 2007 e Open Document Format.</p>

  </li>

  <li>

    <p><strong>Microsoft Office 97-2003 (Microsoft Word/Excel/PowerPoint 2003):</strong></p>

    <p>Estes formatos de ficheiros son propietarios, binarios e ata fai pouco tempo non dispo&ntilde;&iacute;an de documentaci&oacute;n p&uacute;blica, caracter&iacute;sticas que fan que sexa extremadamente dif&iacute;cil traballar con eles nunha ferramenta de traduci&oacute;n asistida.&nbsp;</p>
    
    <p>Algunhas ferramentas de traduci&oacute;n asistida solucionan este problema, cando menos no caso de MS Word, traballando dende o propio Word; a maior&iacute;a das demais ferramentas converten os ficheiros a RTF e de novo ao formato orixinal, un proceso que resulta invisible para a persoa que traduce.</p>

    <p>OmegaT non &eacute; compatible con estes formatos de forma directa. En lugar diso, &eacute; preciso convertelos de forma manual a Office Open XML (MS Office 2007/2010) ou a Open Document Format (LibreOffice ou OpenOffice.org) antes de poder traballar con eles en OmegaT. (OmegaT non &eacute; &uacute;nico neste aspecto, moitas ferramentas de traduci&oacute;n asistida converten os ficheiros de orixe a un formato diferente antes de que sexan traducidos, nalg&uacute;ns casos en segundo plano sen que a persoa que traduce sexa consciente deste proceso.)</p>

  </li>

  <li>
        
    <p><strong>RTF (Formato de texto enriquecido)</strong></p>

    <p>A estrutura de RTF ten certas diferenzas con respecto &aacute; do formato de ficheiro Microsoft Office 98-2003, pero con relaci&oacute;n a OmegaT apl&iacute;canse os mesmos principios: non ten compatibilidade directa e &eacute; preciso converter os ficheiros neste formato a docx (MS Office 2007/2010) ou a Open Document Format (LibreOffice/OpenOffice.org).</p>

  </li>

  <li>
    <p><strong>Formato Open Document: LibreOffice/OpenOffice.org/NeoOffice Writer/Calc/Impress</strong></p>
    
    <p>Estes formatos de ficheiro son os equivalentes dos formatos de Microsoft Office. O formato Open Document &eacute; un est&aacute;ndar internacional que substitu&iacute;u o anterior formato de ficheiro propietario (pero aberto) Star Office (son dous formatos de ficheiro diferentes pero moi similares). OmegaT ten filtros de ficheiro para os formatos Open Document Format e Star Office. Estes filtros de ficheiro son excelentes e o risco de danar o formato dun ficheiro de LibreOffice, OpenOffice.org, etc. durante o proceso de traduci&oacute;n &eacute; extremadamente baixo.</p>

  </li>

  <li>
    
    <p><strong>HTML; XHTML:</strong></p>

    <p>HTML e o seu equivalente XML XHTML son os formatos de ficheiro para p&aacute;xinas web m&aacute;is com&uacute;ns. OmegaT conta con excelentes filtros de ficheiro para ambos. Como ocorre cos ficheiros de OpenOffice.org, estes formatos de ficheiro poden ser traducidos en OmegaT cun risco moi baixo de corrupci&oacute;n. De todos os xeitos, merece a pena personalizar a configuraci&oacute;n dos filtros para obter os mellores resultados.</p>

  </li>

</ul>


<h3>Memorias de traduci&oacute;n</h3>

<p>Existe un est&aacute;ndar internacional para as memorias de traduci&oacute;n: TMX, ou Translation Memory eXchange. Foi amplamente adoptado e &eacute; compatible con case todas as ferramentas de traduci&oacute;n asistida actuais.</p>


<p>O est&aacute;ndar TMX existe en diferentes <b>versi&oacute;ns</b> e diferentes <b>niveis</b>. Esta distinci&oacute;n &eacute; importante de cara &aacute; compatibilidade. O est&aacute;ndar inda est&aacute; en desenvolvemento; a isto se refiren as versi&oacute;ns. Os niveis ref&iacute;rense &aacute; informaci&oacute;n de formato que conte&ntilde;en os ficheiros TMX:</p>

<ul>

  <li>
    
    <p>Os ficheiros TMX de nivel 1 non conte&ntilde;en informaci&oacute;n de formato.</p>

  </li>

  <li>
    
    <p>Os ficheiros TMX de nivel 2 conte&ntilde;en informaci&oacute;n de formato, pero polo xeral estes ficheiros s&oacute; son compatibles cando se usan coa mesma ferramenta de traduci&oacute;n asistida coa que foron creados. &Eacute; dicir, se un usuario de OmegaT atopa unha coincidencia do 100 % nun ficheiro TMX de nivel 2 de OmegaT, pode ser aceptada sen necesidade de adaptala, pero non ocorre o mesmo cun ficheiro TMX de nivel 2 creado por unha ferramenta de traduci&oacute;n asistida diferente (e viceversa). Isto ten repercusi&oacute;ns no ritmo de traballo das persoas que empregan ferramentas de traduci&oacute;n asistida (normalmente clientes), xa que afecta &aacute; forma na que esperan recibir os ficheiros de memorias de traduci&oacute;n para que as coincidencias do 100 % se introduzan de forma autom&aacute;tica.</p>

  </li>

  <li>
    
    <p>Os ficheiros TMX de nivel 3 conte&ntilde;en informaci&oacute;n de formato cunha estrutura que pode ser lida por outras ferramentas de traduci&oacute;n asistida. A compatibilidade das ferramentas de traduci&oacute;n asistida co nivel 3 non &eacute; habitual.</p>

  </li>

</ul>

<p>Certas ferramentas de traduci&oacute;n (como TRADOS) poden exportar diferentes ficheiros TMX en diferentes versi&oacute;ns. OmegaT &eacute; compatible con todas as versi&oacute;ns actuais de TMX, pero ten m&aacute;is posibilidades de ofrecer mellores resultados de coincidencias se a versi&oacute;n do ficheiro TMX &eacute; a 1.4b.&nbsp;</p>

<p>Nun principio, as ferramentas que soportan diferentes niveis de TMX son compatibles entre si. A informaci&oacute;n de formato que conte&ntilde;en os niveis m&aacute;is altos carecer&aacute; de sentido para as \xABoutras\xBB ferramentas, pero seguir&aacute; sendo posible ver a informaci&oacute;n textual, as coincidencias parciais, etc.</p>


<p>OmegaT emprega o est&aacute;ndar internacional TMX como o seu formato de memoria de traduci&oacute;n nativo. Algunhas ferramentas de traduci&oacute;n asistida inda empregan formatos de memoria de traduci&oacute;n dedicados, pero practicamente todas permiten a importaci&oacute;n e exportaci&oacute;n de ficheiros TMX. Isto permite que, na pr&aacute;ctica, as persoas que traducen poidan entregar memorias de traduci&oacute;n aos clientes e viceversa, e que a persoa que reciba estes ficheiros poida empregalos como material de referencia inmediato ou futuro. Por&eacute;n, se o ficheiro vai ser empregado no proceso de traduci&oacute;n, presentaranse as limitaci&oacute;ns descritas anteriormente.</p>

<p>Puntos adicionais que ter en conta en relaci&oacute;n cos ficheiros TMX:</p>

<p>O est&aacute;ndar TMX cont&eacute;n definici&oacute;ns de que caracteres est&aacute;n permitidos. Non todas as ferramentas de traduci&oacute;n asistida son igual de estritas &aacute; hora de aplicar estas restrici&oacute;ns. Desta forma, algunhas ferramentas de traduci&oacute;n asistida son incapaces de abrir ficheiros TMX creados por outras ferramentas de traduci&oacute;n asistida directamente. Por norma xeral, OmegaT ten en conta as condici&oacute;ns e &eacute; tolerante coa incapacidade doutras plataformas de observalas. Por&eacute;n, se aparecen problemas neste aspecto, polo xeral poden ser resoltos con bastante facilidade usando a opci&oacute;n Buscar e substitu&iacute;r nun editor de texto dos caracteres ilegais no ficheiro TMX.</p>

<p>Os ficheiros TMX est&aacute;n codificados en Unicode, pero poden ser UTF-8 ou UTF-16. Os ficheiros TMX creados en sistemas Windows poden comezar cunha marca de orde de bytes (BOM). Polo xeral, estas diferenzas non causan problemas de compatibilidade.</p>

<p>Os problemas de compatibilidade poden estar causados polas diferenzas nos c&oacute;digos de idioma empregados. OmegaT &eacute; compatible con c&oacute;digos de idioma no formato \xABxx\xBB, \xABXX\xBB, \xABxx-YY\xBB e \xABXX-YY\xBB, nos que xx ou XX &eacute; o idioma e yy ou YY &eacute; a rexi&oacute;n. Nun sentido estrito, o est&aacute;ndar ISO para os c&oacute;digos de idioma require \xABxx-YY\xBB (por exemplo: \xABen-GB\xBB para o ingl&eacute;s brit&aacute;nico), inda que esta variante &eacute; compatible con OmegaT, a convenci&oacute;n por defecto que ofrece OmegaT &eacute; \xABXX-YY\xBB, &eacute; dicir, \xABEN-GB\xBB. OmegaT &eacute; tolerante &aacute; hora de ler ficheiros TMX: aceptar&aacute; os ficheiros con en-GB, en-US, en, EN, etc. Non todas as ferramentas de traduci&oacute;n asistidas son tan tolerantes e, polo tanto, &eacute; posible que algunhas non mostren as coincidencias que se esperan se os c&oacute;digos de idioma non son os adecuados. &Eacute; posible resolver esta incompatibilidade buscando e substitu&iacute;ndo os c&oacute;digos de idioma pertinentes no ficheiro TMX cun editor de texto adecuado. Outra posible causa de incompatibilidade son os c&oacute;digos de idioma de tres d&iacute;xitos, que non son compatibles con OmegaT. (Isto d&eacute;bese a unha limitaci&oacute;n de Java, non do propio OmegaT.) </p>

<p>Puntos que ter en conta en relaci&oacute;n cos ficheiros de memoria de traduci&oacute;n propietarios:</p>

<p>O formato de ficheiro de memoria de traduci&oacute;n tradicional de Wordfast &eacute; especialmente interesante debido &aacute; s&uacute;a simplicidade: consiste nun ficheiro de texto plano cunha unidade de traduci&oacute;n (segmento) en cada li&ntilde;a na cal o texto de orixe e a traduci&oacute;n est&aacute;n separados por unha t&aacute;boa. &Eacute; posible converter este formato moi facilmente a TMX con ferramentas de terceiros como <a href="http://groups.yahoo.com/group/wordfast/files/Wf2Tmx-1.0.11.37.zip">Wf2TMX</a>. Tam&eacute;n &eacute; posible usar <a href="http://anaphraseus.sourceforge.net/">Anaphraseus</a> para esta tarefa.</p>

<h3>Ficheiros de glosario</h3>

<p>Os ficheiros de glosario de OmegaT son ficheiros de texto plano co formato:</p>

<p>termo de orixe&nbsp;&nbsp;&nbsp; &lt;tab&gt;&nbsp;&nbsp;&nbsp; termo traducido&nbsp;&nbsp;&nbsp; &lt;tab&gt;&nbsp;&nbsp;&nbsp; informaci&oacute;n adicional</p>

<p>Algunhas ferramentas de traduci&oacute;n asistida son capaces de importar e exportar ficheiros de glosario con este formato, ou nun formato de texto plano similar que pode ser creado de forma moi f&aacute;cil (por exemplo, empregando a funci&oacute;n buscar e substitu&iacute;r de Microsoft Word).</p>

<p>OmegaT tam&eacute;n pode ler glosarios en formato TBX, o est&aacute;ndar da industria para os ficheiros de glosario.</p>

<p>OmegaT non pode importar ou ler ficheiros de glosario en formatos propietarios binarios, tales como Trados Multiterm.</p>

<h3>Formatos biling&uuml;es de ferramentas de traduci&oacute;n asistida</h3>

<p>Moitas ferramentas de traduci&oacute;n asistida empregan un formato de ficheiro intermedio biling&uuml;e, &eacute; dicir, un ficheiro que cont&eacute;n os segmentos do idioma de orixe e do idioma da traduci&oacute;n e, nalg&uacute;ns casos, tam&eacute;n a estrutura do ficheiro orixinal. Nun principio estes ficheiros biling&uuml;es puideron ser un subproduto da arquitectura da ferramenta. Por&eacute;n, transform&aacute;ronse nun fen&oacute;meno importante nos procesos nos que se empregan ferramentas de traduci&oacute;n asistida e, polo xeral, representan o maior obst&aacute;culo na compatibilidade entre OmegaT e outras ferramentas (ou entre as ferramentas de traduci&oacute;n asistida en xeral).</p>

<p>Existen cando menos tres motivos polos que un cliente pode solicitar o env&iacute;o dunha traduci&oacute;n nun formato de ficheiro biling&uuml;e concreto (en lugar do env&iacute;o do ficheiro traducido e quizais tam&eacute;n a memoria de traduci&oacute;n):</p>

<p>1. Algunhas ferramentas de traduci&oacute;n asistida, en especial TRADOS, poden importar unha gran variedade de formatos, entre os que se incl&uacute;en formatos de creaci&oacute;n de publicaci&oacute;ns, e preparalos para a traduci&oacute;n na ferramenta. Normalmente, o formato \xABpreparado\xBB e o formato de ficheiro biling&uuml;e da ferramenta. Sen preparalos desta forma, o ficheiro orixinal pode ser accesible para a persoa que traduce.</p>

<p>2. A traduci&oacute;n s&oacute; &eacute; unha parte do proceso de traballo do cliente. A traduci&oacute;n pode ser enviada a un persoa para que a revise, por exemplo. Se &eacute; preciso inclu&iacute;r os cambios da persoa que realiza a revisi&oacute;n nun repositorio de memorias de traduci&oacute;n mantido polo cliente, os cambios te&ntilde;en que ser realizados <i>antes</i> de crear o ficheiro final. Iso pode realizarse dentro da ferramenta de traduci&oacute;n asistida ou, nalg&uacute;ns casos, nun formato de ficheiro biling&uuml;e externo que a ferramenta pode ler.</p>

<p>3. O cliente desexa recibir unha memoria de traduci&oacute;n para empregala no futuro con outros textos, &eacute; dicir, para \xABpretraducir\xBB outros textos empregando unha memoria de traduci&oacute;n que xa existe. Para volver este proceso tan autom&aacute;tico como sexa posible &eacute; necesario que se cumpran d&uacute;as condici&oacute;ns en concreto: en primeiro lugar, a memoria de traduci&oacute;n debe conter informaci&oacute;n de formato (algo do que falamos nos par&aacute;grafos anteriores) e, en segundo lugar, as regras de segmentaci&oacute;n aplicadas ao texto deben ser as mesmas que aquelas que se aplicaron cando a memoria de traduci&oacute;n (ou unha parte dela) foi creada. A forma m&aacute;is f&aacute;cil de que os clientes poidan asegurarse de que se cumpran estas condici&oacute;ns &eacute; que pretraduzan eles mesmos os textos antes de enviarllos &aacute; persoa que far&aacute; a traduci&oacute;n (e polo tanto establecer como se segmenta) e crear a memoria de traduci&oacute;n na ferramenta de traduci&oacute;n asistida que escolleron despois de recibir o ficheiro de formato biling&uuml;e intermedio da persoa que traduciu, asegur&aacute;ndose desta forma de que a informaci&oacute;n de formato que cont&eacute;n a memoria de traduci&oacute;n ser&aacute; compatible con futuros proxectos.</p>

<p>OmegaT pode traballar con varios formatos de ficheiro biling&uuml;es sen esforzo significativo. Por&eacute;n, &eacute; importante entender o proceso necesario para conseguir isto. A continuaci&oacute;n describimos os formatos de ficheiro biling&uuml;e.</p>

<p><strong>XLIFF</strong></p>

<p>XLIFF &eacute; o formato de ficheiro biling&uuml;e est&aacute;ndar da industria. &Eacute; compatible con varias ferramentas de traduci&oacute;n asistida, de feito, algunhas ferramentas est&aacute;n \xABdese&ntilde;adas arredor\xBB do est&aacute;ndar XLIFF. Heartsome e Swordfish son dous exemplos. Como &eacute; un est&aacute;ndar, XLIFF ten a vantaxe de que os filtros de ficheiro ofrecidos por un fornecedor de ferramentas de traduci&oacute;n asistida para conversi&oacute;ns dun formato concreto a XLIFF (e viceversa) poden en teor&iacute;a empregarse para preparar os ficheiros para a s&uacute;a traduci&oacute;n en calquera ferramenta de traduci&oacute;n asistida compatible con XLIFF. Na pr&aacute;ctica, por norma xeral traballar con XLIFF require o uso de ferramentas que non son f&aacute;ciles de usar.</p>

<p>OmegaT ten compatibilidade rudimentaria con XLIFF. Pode atopar o proceso para usar XLIFF e OmegaT conxuntamente coas ferramentas Rainbow <a href="http://okapi.sourceforge.net/Release/Shared/Help/tutorial_02.htm">aqu&iacute;</a>. Os filtros dispo&ntilde;ibles est&aacute;n destinados na s&uacute;a maior&iacute;a a formatos de ficheiros propios da industria das TI m&aacute;is que a ficheiros empregados polos usuarios finais.<a href="http://okapi.sourceforge.net/Release/Shared/Help/tutorial_02.htm"></a></p>

<p><strong>\xABUncleaned RTF\xBB de Trados</strong></p>

<p>O formato de ficheiro \xABuncleaned RTF\xBB (\xABRTF sen limpar\xBB) de Trados, normalmente denominado como \xABficheiros sen limpar\xBB, leva moitos anos sendo o formato de ficheiros biling&uuml;es m&aacute;is usado nos procesos de traduci&oacute;n. A s&uacute;a orixe est&aacute; no uso de MS Word como interface da ferramenta de traduci&oacute;n asistida Trados. Hai outras ferramentas aparte de Trados compatibles co formato \xABuncleaned RTF\xBB, entre as que destaca Wordfast Classic.  </p>

<p>Este formato consiste basicamente nun ficheiro RTF no que se alternan os segmentos de orixe e de destino. Estes segmentos est&aacute;n marcados e delimitados por caracteres especiais e estilos de formato de MS Word.</p>

<p>En 2008 creouse un script (s&oacute; dispo&ntilde;ible para Windows) e un proceso para permitirlle aos usuarios de OmegaT crear ficheiros de RTF sen limpar de Trados para a s&uacute;a entrega no proceso final da traduci&oacute;n. Poder&aacute; atopar m&aacute;is detalles na <a href="export_uncleaned_rtf">gu&iacute;a para exportar de OmegaT ao formato \xABuncleaned RTF\xBB de Trados</a>.</p>

<p><strong>Trados TTX</strong></p>

<p>O formato Trados TTX &eacute; a equivalente do formato \xABuncleaned RTF\xBB para o editor de etiquetas de Trados (Trados Tag Editor) que, a diferenza de Trados Workbench, non traballa en combinaci&oacute;n directa con MS Word. O formato TTX est&aacute; baseado en XML. Hai un <a href="http://www.opentag.com/okapi/wiki/index.php?title=Okapi_Filters_Plugin_for_OmegaT">complemento de OmegaT</a> dispo&ntilde;ible que permite traballar con este formato en OmegaT.</p>

<p><strong>Wordfast TXML</strong></p>

<p>Wordfast TXML &eacute; un formato interno nativo da nova versi&oacute;n de Wordfast <i>Wordfast Proffesional</i> (tam&eacute;n co&ntilde;ecida como Wordfast 6.0). Tal como suxire o seu nome, &eacute; un formato baseado en XML. &Eacute; compatible con OmegaT.</p>

<p><strong>\xABExternal View\xBB de D&eacute;j&agrave; Vu</strong></p>

<p>Unha caracter&iacute;stica interesante de D&eacute;j&agrave; Vu DVX &eacute; o seu formato de ficheiro \xABExternal View\xBB. Este formato de ficheiro permite &aacute;s persoas que usan OmegaT entregar ficheiros biling&uuml;es a persoas que usan D&eacute;j&agrave; Vu DVX para que poidan editalas ou incorporalas a procesos autom&aacute;ticos. Atopar&aacute; m&aacute;is detalles na <a href="compatibility_deja_vu">gu&iacute;a de \xABExternal View\xBB de D&eacute;j&agrave; Vu</a>.<br/></p>

<p>Copyright Marc Prior 2009-2014</p>

</div>

