<div class="container">

<h2>Gu&iacute;a de OmegaT: Compatibilidade de OmegaT con D&eacute;j&agrave; Vu</h2>

<p>Esta gu&iacute;a explica como usar OmegaT xunto coa ferramenta de traduci&oacute;n asistida de Atril D&eacute;j&agrave; Vu. </p>

<h3>Situaci&oacute;n</h3>

<p>Vostede realiza as traduci&oacute;ns con OmegaT e un cliente solicita que entregue unha traduci&oacute;n no formato de ficheiro de D&eacute;j&agrave; Vu. Pode facelo (no caso do D&eacute;j&agrave; Vu DVX) usando o formato de ficheiro de D&eacute;j&agrave; Vu \xABExternal Views\xBB. </p>

<h3>\xABExternal View\xBB de D&eacute;j&agrave; Vu</h3>

<p>O formato \xABExternal View\xBB de D&eacute;j&agrave; Vu &eacute; unha das caracter&iacute;sticas de D&eacute;j&agrave; Vu DVX. Perm&iacute;telle aos editores que pos&uacute;en D&eacute;j&agrave; Vu editar traduci&oacute;ns producidas en D&eacute;j&agrave; Vu de forma que as correcci&oacute;ns poden ser introducidas de forma sinxela. Da mesma forma os usuarios de ferramentas de traduci&oacute;n asistida, inclu&iacute;ndo OmegaT, que non pos&uacute;an D&eacute;j&agrave; Vu poden traducir ficheiros preparados por un usuario de D&eacute;j&agrave; Vu.</p>

<p>Un ficheiro \xABExternal View\xBB de D&eacute;j&agrave; Vu &eacute; un ficheiro RTF que cont&eacute;n unha t&aacute;boa con m&uacute;ltiples columnas, inclu&iacute;ndo columnas para o texto de orixe e o texto de destino, nas cales cada segmento ocupa unha cela. Nun ficheiro \xABExternal View\xBB sen traducir a columna de destino est&aacute; baleira. Para crear un ficheiro \xABExternal View\xBB traducido hai que introducir a traduci&oacute;n na columna de destino. Os pasos para traducir o ficheiro en OmegaT son os seguintes:</p>

<p>1. Converta o ficheiro RTF ao formato OpenOffice.org.</p>

<p>2. Faga unha copia do ficheiro External View, e nesta copia borre o contido de todas as columnas excepto os da columna do texto de orixe.</p>

<p>3. Traduza este ficheiro en OmegaT da forma habitual. As etiquetas que pode atopar nos segmentos aparecen como n&uacute;meros de serie dentro de chaves, por exemplo, {1}, {2}, etc. Debe tratar estas etiquetas como tratar&iacute;a as de OmegaT (ten que ter en conta que as funci&oacute;ns de etiquetas de OmegaT, tales como a funci&oacute;n de validaci&oacute;n de etiquetas, non est&aacute;n dispo&ntilde;ibles neste caso).</p>

<p>4. Unha vez te&ntilde;a completado a traduci&oacute;n e creado os documentos traducidos, copie a columna traducida que atopar&aacute; no documento traducido na columna de <span style="font-style: italic;">destino</span> do ficheiro orixinal.</p>

<p>5. Converta o ficheiro de novo a formato RTF.</p>

<p>Para que este proceso funcione, o usuario de D&eacute;j&agrave; Vu debe preparar o ficheiro de orixe e entregarllo ao tradutor no formato \xABExternal View\xBB de D&eacute;j&agrave; Vu. Pode atopar m&aacute;is informaci&oacute;n sobre o formato e o proceso para crealo, tanto para usuarios de D&eacute;j&agrave; Vu como doutras ferramentas de traduci&oacute;n asistida, na <a href="http://www.atril.com/sites/default/files/InstructionsExternalView.pdf">p&aacute;xina de Atril correspondente</a> e no &uacute;til <a href="http://simmer-lossner.blogspot.com/2008/11/dj-vu-x-as-editing-tool-for-trados-jobs.html">blog que mant&eacute;n Kevin Lossner</a>.</p>

<p>Copyright Marc Prior 2009-2011</p>

</div>

