<div class="container">

<h2>Gu&iacute;a: Engadir unha funci&oacute;n de vista previa a OmegaT:</h2>

<h3>Situaci&oacute;n</h3>

<p>A maior&iacute;a das ferramentas de traduci&oacute;n asistida mostran o texto dividido en segmentos en lugar de mostralo co dese&ntilde;o e formato final. A pesar das vantaxes deste m&eacute;todo, ter a capacidade de ver o dese&ntilde;o e formato final mentres traduce p&oacute;delle resultar moi &uacute;til &aacute; persoa que est&aacute; a realizar a traduci&oacute;n. Por este motivo, moitas ferramentas de traduci&oacute;n asistida ofrecen unha funci&oacute;n de vista previa que mostra o dese&ntilde;o e o formato sen que a persoa que traduce te&ntilde;a que crear o documento final e abrilo nunha ferramenta diferente (normalmente un procesador de textos). OmegaT non ten unha funci&oacute;n integral de vista previa, pero &eacute; posible obter unha funci&oacute;n similar usando software adicional. Esta gu&iacute;a explica o proceso xeral para configurar unha funci&oacute;n de vista previa.</p>

<h3>Principios</h3>

<p>De ser posible, un visor debe facer d&uacute;as cousas:</p>

<ul>

<li>Deber&iacute;a mostrar o texto dunha forma que se aproxime ao dese&ntilde;o e formato final.</li>

<li>Deber&iacute;a actualizarse de forma continua.</li>

</ul>


<h3>Navegador</h3>

<p>Se est&aacute; traducindo ficheiros .html, unha soluci&oacute;n c&oacute;moda &eacute; empregar un navegador con funci&oacute;n de actualizaci&oacute;n autom&aacute;tica para ter unha funci&oacute;n de vista previa xa lista. Exemplos de navegadores con funci&oacute;n de actualizaci&oacute;n autom&aacute;tica:</p>

<ul>

<li>Firefox:<br/>Os usuarios de Windows que non usan Firefox poden <a href="http://www.mozilla.org">descargalo de www.mozilla.org</a>. A maior&iacute;a dos usuarios de Linux xa o ter&aacute;n instalado, ou poden instalalo a trav&eacute;s dos repositorios da s&uacute;a distribuci&oacute;n. Para engadir unha funci&oacute;n de actualizaci&oacute;n autom&aacute;tica, <a href="http://addons.mozilla.org/de/firefox/addon/reloadevery/">instale o complemento \xABReloadEvery\xBB</a>.</li>

<li>Opera:<br/>Opera est&aacute; dispo&ntilde;ible para todas as plataformas, &eacute; moi r&aacute;pido e require poucos recursos de hardware. <a href="http://www.opera.com">Desc&aacute;rgueo en www.opera.com</a> (ou se usa Linux, dende os repositorios da s&uacute;a distribuci&oacute;n). O navegador ten a funci&oacute;n de actualizaci&oacute;n autom&aacute;tica integrada.</li>

<li>Chrome:<br/>Chrome tam&eacute;n est&aacute; dispo&ntilde;ible para todas as plataformas. <a href="www.google.com/chrome">Desc&aacute;rgueo de www.google.com/chrome</a>. Para engadir a funci&oacute;n de actualizaci&oacute;n autom&aacute;tica a Chrome, <a href="http://chrome.google.com/webstore/detail/oilipfekkmncanaajkapbpancpelijih">descargue e instale a extensi&oacute;n Auto Refresh Plus</a> da Web Store. </li>

</ul>

<p>&Eacute; posible que prefira <i>non</i> empregar o seu navegador habitual para a vista previa e que desta forma estea libre para navegar por internet en lugar de ter que cambiar de pestanas constantemente, polo que pode considerar a instalaci&oacute;n doutro navegador para a vista previa coma unha vantaxe.</p>

<p>Despois de seleccionar e instalar un navegador adecuado (e o complemento requirido), abra o ficheiro traducido no cartafol /target do seu proxecto:</p>

<ul>

<li>Usando Firefox: con Ficheiro &gt; Abrir ficheiro</li>
<li>Usando Opera: con Opera &gt; P&aacute;xina &gt; Abrir</li>

</ul>

<p>Agora ten que activar a actualizaci&oacute;n autom&aacute;tica. Tanto en Firefox como en Opera pode facer isto dando clic dereito no ficheiro .html que abriu, e logo seleccionando Actualizar cada &gt; o intervalo que desexe (por exemplo, 5 segundos).</p>

<p>Agora disp&oacute;n dunha funci&oacute;n de vista previa. Para actualizar a visualizaci&oacute;n, debe gardar e crear o ficheiro de destino en OmegaT con Ctrl+s, Ctrl+d. Unha vez faga isto o cambio farase visible nun tempo que como moito equivaler&aacute; ao intervalo que seleccionou (ademais do tempo que precise OmegaT para gardar e crear os ficheiros). O seu navegador non se desprazar&aacute; pola p&aacute;xina a medida que traduce o texto, ter&aacute; que facelo vostede manualmente. Con todo, manterase no mesmo punto no que estaba o texto cando se actualice a vista previa.</p>

<h3>Vista previa de ficheiros de tratamento de texto</h3>

<p>Abrir o seu ficheiro de destino traducido nun navegador &eacute; f&aacute;cil cando seu ficheiro de orixe est&aacute; en formato .html, pero as traduci&oacute;ns normalmente est&aacute; en ficheiros de tratamento de texto, que en OmegaT normalmente se procesan en formato .docx ou .odt. Inda pode usar a opci&oacute;n do navegador descrita antes para obter unha vista previa destes ficheiros, pero tam&eacute;n precisar&aacute; a) un convertedor para converter o ficheiro a formato .html, e b) unha ferramenta para executar o convertedor de forma autom&aacute;tica para as&iacute; non ter que converter os ficheiros de forma manual.</p>

<p>A continuaci&oacute;n ten dous programas que poden ser usados como convertedores. Abiword e LibreOffice.</p>

<p>Abiword e LibreOffice son, respectivamente, un procesador de palabras e un conxunto de ferramentas de oficina. Ambos son gratu&iacute;tos, est&aacute;n dispo&ntilde;ibles para varias plataformas e poden converter ficheiros .docx e .odt a formato .html.</p>

<p>A descarga de Abiword &eacute; relativamente pequena e &eacute; moi r&aacute;pido de usar. Ten unha funcionalidade de li&ntilde;a de comandos para converter ficheiros .docx e .odt a formato .html. &Eacute; moi f&aacute;cil instalalo para as persoas que usan Linux e relativamente f&aacute;cil para as persoas que usan Windows. <a href="http://www.abisource.com/download/">Descargue Abiword aqu&iacute;</a>.</p>

<p>LibreOffice &eacute; un conxunto de ferramentas de oficina completa similar a Microsoft Office. Tam&eacute;n &eacute; posible empegala para converter ficheiros .docx e .odt ao formato .html, pero require o complemento Unoconv para facelo dende a li&ntilde;a de comandos. <a href="http://www.libreoffice.org/">Descargue LibreOffice aqu&iacute;</a>; <a href="http://dag.wieers.com/home-made/unoconv/">descargue o complemento Unoconv aqu&iacute;</a>.</p>

<p>Unha vez te&ntilde;a instalado Abiword ou a combinaci&oacute;n de LibreOffice+Unoconv, poder&aacute; converter os ficheiros de destino producidos por OmegaT ao formato .html para que o navegador os poida ler. Recorde que primeiro ten que gardar en OmegaT e crear os ficheiros traducidos, despois executar a ferramenta de conversi&oacute;n e por &uacute;ltimo esperar a que a vista se actualice no navegador.</p>

<p>Hai m&uacute;ltiples formas de conseguir isto, pero unha soluci&oacute;n pr&aacute;ctica &eacute; usar un script que \xABescoite\xBB os cambios nos ficheiros producidos por OmegaT e despois, cando detecta un cambio, executa automaticamente a ferramenta que converte os ficheiros a formato .html para que o navegador os poida ler. A continuaci&oacute;n se mostra un diagrama esquem&aacute;tico:</p>

<p><img src="../../images/preview_flow.png" alt="preview_flow.png"></img></p>

<p>Descr&iacute;bese un script de exemplo que logra esta funci&oacute;n na <a href="priorview.html">Gu&iacute;a de Priorview</a>.</p>

<br/><br/>

<p>Copyright Marc Prior 2012</p>

</div>

