<div class="container">

<h2>Gu&iacute;a de propagaci&oacute;n e coincidencias individuais-colectivas</h2>

<h3>Introduci&oacute;n</h3>

<p>Esta gu&iacute;a describe as funci&oacute;ns de propagaci&oacute;n autom&aacute;tica de coincidencias e coincidencias individuais-colectivas</p>

<h3>Propagaci&oacute;n</h3>

<p>Omega T emprega a funci&oacute;n de propagaci&oacute;n autom&aacute;tica de coincidencias por defecto. Isto quere dicir que tan pronto como se traduce un segmento, OmegaT insire a mesma traduci&oacute;n de forma autom&aacute;tica en todos os segmentos id&eacute;nticos. Se xa se traduciu un segmento e se modifica outro id&eacute;ntico que aparece m&aacute;is adiante no texto, actualizarase o segmento orixinal coa modificaci&oacute;n. En OmegaT denominamos os segmentos que aparecen en m&aacute;is dunha ocasi&oacute;n como \xABsegmentos non &uacute;nicos\xBB.</p>

<p>Se selecciona Ver &gt; Marcar segmentos non &uacute;nicos o programa mostrar&aacute; a primeira aparici&oacute;n dun segmento non &uacute;nico en negro e as seguintes en gris. Esta funci&oacute;n resulta &uacute;til durante a revisi&oacute;n dunha traduci&oacute;n, pois &eacute; posible que s&oacute; sexa necesario revisar a primeira aparici&oacute;n dun segmento non &uacute;nico e, desta forma, comprobar que un segmento marcado en gris, en lugar de en negro, xa foi revisado. (Se seleccionou Opci&oacute;ns &gt; Ver &gt; \xABInclu&iacute;r os primeiros segmentos non &uacute;nicos cando se marcan os segmentos non &uacute;nicos\xBB, todas as aparici&oacute;ns dos segmentos non &uacute;nicos estar&aacute;n en gris.)</p>

<p>Pode desactivar a funci&oacute;n de propagaci&oacute;n autom&aacute;tica de coincidencias en Proxecto &gt; Propiedades &gt; \xABPropagaci&oacute;n autom&aacute;tica das traduci&oacute;ns\xBB. Isto causar&aacute; que todas as repetici&oacute;ns de segmentos non &uacute;nicos sexan consideradas traduci&oacute;ns alternativas (vexa \xABCoincidencias individuais-colectivas\xBB m&aacute;is abaixo).</p>

<h3>Coincidencias individuais-colectivas</h3>

<p>Na maior&iacute;a dos casos, a persoa que realiza a traduci&oacute;n querer&aacute; traducir os segmentos id&eacute;nticos dentro dun proxecto da mesma forma. Para os casos nos que dous os varios segmentos id&eacute;nticos requiran traduci&oacute;ns diferentes, OmegaT ofrece o sistema \xABcoincidencias individuais-colectivas\xBB.</p>

<p>A funci&oacute;n coincidencias individuais-colectivas de OmegaT asume en primeiro lugar que os segmentos id&eacute;nticos deben ser traducidos da mesma forma. Denominamos este proceso como \xABtraduci&oacute;n por defecto\xBB. Para crear unha traduci&oacute;n diferente da \xABtraduci&oacute;n por defecto\xBB ten que facer clic co bot&oacute;n dereito do rato no segmento e seleccionar \xABCrear unha traduci&oacute;n alternativa\xBB. Desta forma poder&aacute; traducir o segmento como desexe sen que as futuras repetici&oacute;ns se traduzan de forma autom&aacute;tica para que sexan id&eacute;nticas a el.</p>

<p>Pode ter tantas \xABtraduci&oacute;ns alternativas\xBB de segmentos id&eacute;nticos como desexe, pero s&oacute; pode haber unha traduci&oacute;n por defecto (ou, se for o caso, ningunha).</p>

<p>Pode converter unha traduci&oacute;n alternativa na traduci&oacute;n por defecto facendo clic dereito co rato nela e escollendo \xABEmpregar como traduci&oacute;n por defecto\xBB. Desta forma converter&aacute; a traduci&oacute;n empregada no segmento seleccionado na traduci&oacute;n por defecto. OmegaT utilizar&aacute; esta traduci&oacute;n para actualizar todas as repetici&oacute;ns do mesmo segmento que empregaban a anterior \xABtraduci&oacute;n por defecto\xBB.</p>

<p>Se xa traduciu una repetici&oacute;n dun segmento non &uacute;nico e desexa que outra versi&oacute;n do segmento non &uacute;nico sexa a traduci&oacute;n por defecto sen cambiar o segmento xa traducido, deber&aacute; cambiar o estado do segmento traducido a \xABtraduci&oacute;n alternativa\xBB coa opci&oacute;n \xABCrear unha traduci&oacute;n alternativa\xBB. </p>

<p>Para eliminar o estado de \xABtraduci&oacute;n alternativa\xBB dun s&oacute; segmento e actualizalo coa nova \xABtraduci&oacute;n por defecto\xBB, s&oacute; ten que eliminar o contido dese segmento. Desta forma eliminar&aacute; a \xABtraduci&oacute;n alternativa\xBB e o segmento actualizarase coa \xABtraduci&oacute;n por defecto\xBB. Pode eliminar o contido dun segmento empregando os atallos de teclado Ctrl+A &gt; Ctrl+X &gt; Intro, facendo clic dereito co rato e escollendo a opci&oacute;n \xABEliminar traduci&oacute;n\xBB ou simplemente usando a tecla SUPR de forma repetida.</p>


<h3>Gu&iacute;a de comandos de propagaci&oacute;n e coincidencias individuais-colectivas</h3>

<p><b>Nada </b>(comportamento por defecto): todos os segmentos id&eacute;nticos trad&uacute;cense automaticamente da mesma forma.</p>

<p><b>Marcar os segmentos non &uacute;nicos</b>: OmegaT marca os segmentos id&eacute;nticos en gris (esta opci&oacute;n cambia a visualizaci&oacute;n, pero non o comportamento do programa).</p>

<p><b>Crear unha traduci&oacute;n alternativa</b>: converte o segmento en &uacute;nico e, desta forma, os cambios que realice neste segmento non ter&aacute;n efecto noutros segmentos nin se ver&aacute; afectado polos cambios na \xABtraduci&oacute;n por defecto\xBB.</p>

<p><b>Eliminar traduci&oacute;n</b>: elimina o contido do segmento, permitindo desta forma que se actualice (cando prema Intro) coa traduci&oacute;n por defecto.</p>

<p><b>Empregar como traduci&oacute;n por defecto</b>: converte o segmento seleccionado na traduci&oacute;n por defecto e, polo tanto, todos os segmentos que antes empregaban a \xABtraduci&oacute;n por defecto\xBB ser&aacute;n actualizados coa nova versi&oacute;n.</p>



<h3>Aspectos que debe ter en conta</h3>

<p>No caso dalg&uacute;ns tipos de ficheiro, OmegaT diferencia os segmentos id&eacute;nticos tendo en conta os segmentos que os preceden e seguen. Polo tanto, para poder crear unha traduci&oacute;n alternativa, os segmentos id&eacute;nticos deben estar precedidos e seguidos por segmentos distintos. Nos casos nos que dous segmentos estean precedidos e seguidos por segmentos id&eacute;nticos (por exemplo, cando unha p&aacute;xina enteira aparece d&uacute;as veces no mesmo texto), non se poder&aacute;n traducir de forma diferente, &eacute; dicir, OmegaT non pode crear unha \xABtraduci&oacute;n alternativa\xBB.</p>

<p>\xABSegmentos non &uacute;nicos\xBB abarca tanto a traduci&oacute;n por defecto como as alternativas. Desta forma, os segmentos que estean marcados (coa fonte en gris) como segmentos non &uacute;nicos est&aacute;n marcados desta forma independentemente de se existen traduci&oacute;ns alternativas ou non.</p>

<p>Por defecto, o comando Ir ao seguinte segmento non traducido (Ctrl+U) ir&aacute; ao seguinte segmento sen traducir, saltando traduci&oacute;ns propagadas no proceso. Pola contra, se escolleu Opci&oacute;ns &gt; Editar comportamento &gt; \xABIr ao seguinte segmento sen traducir detense cando hai polo menos unha traduci&oacute;n alternativa\xBB e existe polo menos unha traduci&oacute;n alternativa dun segmento non &uacute;nico, esta funci&oacute;n tratar&aacute; todas as repetici&oacute;ns dese segmento (xa sexan traduci&oacute;ns por defecto ou alternativas) como segmentos sen traducir e polo tanto non os saltar&aacute;.</p>


<p>Copyright Marc Prior 2014</p>

</div>

