<div class="container">

<h2>Gu&iacute;a do corrector ortogr&aacute;fico de OmegaT</h2>

<p>OmegaT ten un corrector ortogr&aacute;fico integrado. Esta caracter&iacute;stica emprega os dicionarios ortogr&aacute;ficos usados en LibreOffice e OpenOffice.org. Hai dicionarios dispo&ntilde;ibles para m&uacute;ltiples idiomas.</p>

<h3>Instalar novos dicionarios dende OmegaT</h3>

<p>Poden instalarse novos dicionarios ortogr&aacute;ficos dende OmegaT no men&uacute; Opci&oacute;ns &gt; Verificaci&oacute;n ortogr&aacute;fica. Neste men&uacute;, escolla ou cree un cartafol de dicionarios no seu disco duro. Este &eacute; o cartafol no que se almacenar&aacute;n os ficheiros de dicionarios ortogr&aacute;ficos. (Non confunda este cartafol co cartafol \xABdictionary\xBB nos proxectos de OmegaT.) Despois escolla a URL (direcci&oacute;n de sitio web) dun repositorio en li&ntilde;a do cal descargar o dicionario ou dicionarios, e pegue esta URL no campo \xABURL de dicionarios en rede\xBB. Debaixo hai unha lista de URLs de repositorios. </p>

<p><a name="repositories">URLs de repositorios de dicionarios ortogr&aacute;ficos:</a></p>

<p>http://download.services.openoffice.org/files/contrib/dictionaries/<br/>http://openoffice.paris.fr/openoffice/contrib/dictionaries/<br/>http://openoffice.osuosl.org/contrib/dictionaries/<br/>http://ftp.uni-kl.de/pub/OpenOffice/contrib/dictionaries/<br/>http://ftp.uni-erlangen.de/mirrors/openoffice/contrib/dictionaries/<br/>http://ftp.fernuni-hagen.de/ftpdir/pub/mirrors/www.openoffice.org/contrib/dictionaries/<br/>http://ftp.plusline.de/OpenOffice/contrib/dictionaries/<br/>http://ftp.plusline.de/OpenOffice/contrib/dictionaries/<br/>http://ftp.nluug.nl/office/openoffice/contrib/dictionaries/<br/>http://ftp.nluug.nl/office/openoffice/contrib/dictionaries/<br/>http://linorg.usp.br/OpenOffice.org/contrib/dictionaries/<br/>http://ftp.uni-muenster.de/pub/mirrors/ftp.openoffice.org/contrib/dictionaries/<br/>http://ftp.uni-http://openoffice.mirrors.tds.net/pub/openoffice/contrib/dictionaries/<br/>http://openoffice.mirrors.tds.net/pub/openoffice/contrib/dictionaries/<br/>http://artfiles.org/openoffice.org/contrib/dictionaries/<br/>http://artfiles.org/openoffice.org/contrib/dictionaries/<br/>http://ftp.heanet.ie/mirrors/openoffice.org/contrib/dictionaries/<br/>http://ftp.heanet.ie/mirrors/openoffice.org/contrib/dictionaries/<br/>http://freebsd.csie.nctu.edu.tw/distfiles/openoffice.org1.1/<br/>http://freebsd.csie.nctu.edu.tw/distfiles/openoffice.org1.1/<br/>http://planetmirror.com/pub/OpenOffice/contrib/dictionaries/<br/>http://planetmirror.com/pub/OpenOffice/contrib/dictionaries/<br/>http://ftp.riken.go.jp/pub/FreeBSD/distfiles/openoffice/<br/>http://ftp.riken.go.jp/pub/FreeBSD/distfiles/openoffice/<br/>http://openoffice.mirror.wrpn.net/contrib/dictionaries/<br/>http://openoffice.mirror.wrpn.net/contrib/dictionaries/<br/>
</p>

<h3>Instalar novos dicionarios ortogr&aacute;ficos de forma manual</h3>

<p>No men&uacute; Opci&oacute;ns &gt; Verificaci&oacute;n ortogr&aacute;fica, escolla ou cree un cartafol de dicionarios no seu disco duro.</p>

<p>Obte&ntilde;a os ficheiros.dlc e .aff do dicionario que queira usar e p&oacute;&ntilde;aos neste cartafol.</p>

<p>Ademais de estar dispo&ntilde;ibles nos repositorios previamente citados, os dicionarios ortogr&aacute;ficos tam&eacute;n est&aacute;n dispo&ntilde;ibles nas instalaci&oacute;ns de LibreOffice e OpenOffice.org. LibreOffice e as versi&oacute;ns m&aacute;is recentes de OpenOffice.org empregan o formato \xABextensions\xBB destes dicionarios, no cal os ficheiros est&aacute;n nun ficheiro comprimido coa extensi&oacute;n .oxt. Para empregar dicionarios ortogr&aacute;ficos neste formato, ter&aacute; que cambiar a extensi&oacute;n do ficheiro de .oxt a .zip e usar un programa de ficheiros zip (WinZip, por exemplo) para extraer os ficheiros .dlc e .aff.</p>

<p>O nome dos ficheiros corresp&oacute;ndese co c&oacute;digo do idioma da s&uacute;a lingua de chegada, tal e como se define no men&uacute; das propiedades do proxecto (Proxecto &gt; Propiedades). Por exemplo, se seleccionou ES-MX (espa&ntilde;ol de M&eacute;xico) como o idioma de chegada, os ficheiros do dicionario deben chamarse es_MX.dic e es_MX.aff. Se s&oacute; ten un dicionario de espa&ntilde;ol de Bolivia dispo&ntilde;ible, cos nomes de ficheiro es_BO.dic e es_BO.aff, pode cambiar o nome destes ficheiros por es_MX.dic e es_MX.aff, e o dicionario ortogr&aacute;fico funcionar&aacute;. (Por suposto, far&aacute;n as correcci&oacute;ns en espa&ntilde;ol de Bolivia e non en espa&ntilde;ol de M&eacute;xico!)</p>

<h3>Lista de comprobaci&oacute;n de soluci&oacute;n de problemas</h3>

<p>Comprobe que a verificaci&oacute;n ortogr&aacute;fica est&aacute; activada no men&uacute; de verificaci&oacute;n ortogr&aacute;fica.</p>

<p>Se o proceso de instalaci&oacute;n autom&aacute;tica no funciona: comprobe que a s&uacute;a conexi&oacute;n a internet funciona. De ser as&iacute;, probe cunha URL de repositorio diferente. Comprobe que ten permisos de escritura para o cartafol de dicionarios ortogr&aacute;ficos que escolleu.</p>

<p>Comprobe que os ficheiros .dlc e .aff do seu idioma se atopan no cartafol, e que os seus nomes se corresponden co c&oacute;digo da s&uacute;a lingua.</p>


<p>Copyright Marc Prior 2009-2011 </p>

</div>

