<div class="container">
  <p>Ce site est maintenu au nom du projet OmegaT par :</p>
  <p>Marc Prior<br/>
Baumeistersweg 12<br/>
45896 Gelsenkirchen<br/>
Germany<br/>
</p>
  <table>
    <tbody>
      <tr>
        <td>Contenu du site Web :</td>
        <td>Marc Prior</td>
      </tr>
      <tr>
        <td>Graphisme du site Web :</td>
        <td>Camille Moulin</td>
      </tr>
      <tr>
        <td>Traduction fran&#xE7;aise du contenu :</td>
        <td>Brigitte Le Grand</td>
      </tr>
    </tbody>
  </table>
  <h2>Le projet OmegaT</h2>
  <p>Le projet OmegaT existe gr&#xE2;ce &#xE0; un groupe informel et international de b&#xE9;n&#xE9;voles. Son objectif est de d&#xE9;velopper, distribuer et promouvoir OmegaT, un logiciel open source de m&#xE9;moire de traduction.</p>
  <p>Les principaux acteurs du projet sont :</p>
  <div class="text-md-center">
    <h3>Cr&#xE9;ateur du logiciel OmegaT</h3>
    <p>Keith Godfrey</p>
    <h3>Chef de projet</h3>
    <p>Didier Briel</p>
    <h3>D&#xE9;veloppeur principal</h3>
    <p>Alex Buloichik</p>
    <h3>Gestionnaire d'int&#xE9;gration</h3>
    <p>Aaron Madlon-Kay</p>
    <h3>Coordinateur du projet et responsable du site Web</h3>
    <p>Marc Prior</p>
    <h3>Responsable de la documentation</h3>
    <p>Vincent Bidaux</p>
    <h3>Responsable de la localisation, propri&#xE9;taire du groupe des utilisateurs</h3>
    <p>Jean-Christophe Helary</p>
    <h3>D&#xE9;veloppeurs</h3>
    <p>Keith Godfrey, Lev Abashkin, Zoltan Bartko, Volker Berlin, Didier Briel, Kim Bruning, Alex Buloichik, Thomas Cordonnier, Sandra Jean Chua, Enrique Est&#xE9;vez Fern&#xE1;ndez, Martin Fleurke, Wildrich Fourie, Tony Graham, Phillip Hall, Jean-Christophe Helary, Chihiro Hio, Thomas Huriaux, Hans-Peter Jacobs, Kyle Katarn, Piotr Kulik, Ibai Lakunza Velasco, Guido Leenders, Aaron Madlon-Kay, Fabi&#xE1;n Mandelbaum, Manfred Martin, Adiel Mittmann, Hiroshi Miura, John Moran, Maxym Mykhalchuk, Arno Peters, Henry Pijffers, Briac Pilpr&#xE9;, Tiago Saboga, Andrzej Sawu&#x142;a, Benjamin Siband, Yu Tang, Rashid Umarov, Antonio Vilei, Ilia Vinogradov, Martin Wunderlich and Michael Zakharov</p>
  </div>
  <p>Pour mieux comprendre l'esprit OmegaT, nous vous invitons &#xE0; d&#xE9;couvrir la <a href="philosophy.html">philosophie du projet</a>.</p>
  <p>Depuis ses d&#xE9;buts, le projet a re&#xE7;u le soutien de bien d'autres contributeurs, h&#xE9;las trop nombreux pour &#xEA;tre cit&#xE9;s ici, mais pour l'aide desquels nous sommes tr&#xE8;s reconnaissants.</p>
</div>
