<div class="container">
		
<h2>Shkarkimet</h2>



		
<h3>OmegaT</h3>



		
<p>Versionet Zyrtare (nd&euml;rtimet e plasuara nga OmegaT projektit)</p>



		
<table>



		<tbody>


    <tr>


      <td><a href="http://sourceforge.net/projects/omegat">Hap&euml;sira e shkarkimit t&euml; Sourceforge</a></td>


      <td>Shkarko nga k&euml;tu t&euml; gjitha versionet zyrtare.</td>


    </tr>


    <tr>


      <td><a href="http://sourceforge.net/project/platformdownload.php?group_id=68187">Versionet e rekomanduara p&euml;r shfryt&euml;zuesit e  Windows-it</a></td>


      <td>Shkurtes&euml; shkarkimi te versioni 1.7.3 p&euml;r Windows, me Java JRE t&euml; p&euml;rfshir&euml;. N&euml;se e p&euml;rdor Windows-in, kjo tani p&euml;r tani &euml;sht&euml; versioni &quot;pa dhimbje&quot; e rekomanduar.</td>


    </tr>


  
  
  </tbody>
</table>



				
<p>Versionet speciale (nd&euml;rtimet testuese dhe nd&euml;rtimet t&euml; plasuara nga kontribuesit tjer&euml;):</p>



				
<table>



					<tbody>


    <tr>



						<td><a href="../specials/OmegaT_1.4.1_ca.zip">Versioni katalan i OmegaT-s&euml; 1.4.1</a></td>


                        <td>Kontribuuar nga Mikel L. Forcada</td>


    </tr>



						<tr>


      <td><a href="../specials/1.3.5_af.zip">Versioni afrikaans i OmegaT 1.3.5</a></td>


      <td>Kontribuuar nga Samuel Murray. Nd&euml;rfaq&euml;si i shfryt&euml;zuesit afrikaans - dokumentacioni n&euml; anglisht.</td>


    </tr>



					<tr>


      <td><a href="../specials/OmegaT_DG.zip">Shortcut build</a></td>


      <td>Special build contributed by Dmitri Gabinski, with additional keyboard shortcuts.</td>


    </tr>



					
  
  
  </tbody>
				
</table>



				
<h3>Softuer&euml;t e pal&euml;ve t&euml; treta (esenciale ose t&euml; rekomanduara fuqish&euml;m)</h3>



				
<table>



					<tbody>



						<tr>


      <td><a href="http://java.sun.com/j2se/1.4.2/download.html">Sun Java</a></td>



						<td>Windows, Linux, Solaris.</td>


    </tr>



					<tr>


      <td><a href="http://developer.apple.com/java">Macintosh OS X</a></td>



						<td>Vet&euml;m informat&euml;; Shfryt&euml;zuesit e Mac OS X do t&euml; duhet t&euml; gjejn&euml;  Java Runtime hap&euml;sir&euml;n tanim&euml; t&euml; instaluar.</td>


    </tr>



					<tr>


      <td><a href="http://openoffice.org/">OpenOffice.org</a></td>


      <td>Versioni falas i StarOffice. E aft&euml;son OmegaT p&euml;r t&euml; manipuluar skedar&euml;t formatet MS Word, Excel dhe Powerpoint.</td>



					  </tr>

    <tr>

      <td><a href="http://sourceforge.net/projects/bitext2tmx">bitext2tmx</a></td>

      <td>Mjet vij&euml;zimi i pal&euml;ve t&euml; treta p&euml;r prodhimin e skedar&euml;ve t&euml; memorieve t&euml; p&euml;rkthimit nga tekstet e trashiguara dhe p&euml;rkthimet e tyre.</td>

    </tr>


  
  
  </tbody>
</table>



  </div>



			
