<div class="container">
			
<h2>Projekti OmegaT dhe Ju</h2>


			
<p>OmegaT nuk &euml;sht&euml; vet&euml;m nj&euml; produkt; &euml;sht&euml; nj&euml; projekt ngaz&euml;llues, dhe ju mund t&euml; jeni pjes&euml; e tij.</p>

<p> OmegaT &euml;sht&euml; softuer falas. Kjo n&euml;nkupton q&euml; shfryt&euml;zuesit si ti jen&euml; t&euml; lir&euml; t&euml; shkarkoni dhe t&euml; p&euml;rdorni vet&euml;m pak n&euml; aspektin e ndalesave. Ju jeni t&euml; lir&euml; ta kopjoni dhe t&euml; pasoni at&euml; te njer&euml;zit tjer&euml;.</p>
<p>OmegaT &euml;sht&euml; softuer me kod-t&euml;-hapur. Kjo n&euml;nkupton n&euml;se jeni aq t&euml; prirur, ju mund t&euml; ndryshoni OmegaT-en&euml; q&euml; tu p&euml;rshtatet k&euml;rkesave tuaja. P&euml;r p&euml;rkrah&euml;sit e softuerit me kod-t&euml;-hapur, kjo liri &euml;sht&euml; m&euml; tep&euml;r e r&euml;nd&euml;sishme se sa p&euml;rjashtimi q&euml; t&euml; keni p&euml;r t&euml; paguar ndonj&euml; gj&euml;.</p>


			 
<p>Nga tolloni i njejt&euml;, projekti OmegaT udh&euml;hiqet nga vullnetar&euml;t q&euml; nuk pranojn&euml; ndonj&euml; pages&euml; p&euml;r pun&euml;n q&euml; ata e b&euml;jn&euml; dhe koh&euml;n q&euml; ata dhe koh&euml;n q&euml; ata kan&euml; kaluar n&euml; projekt. N&euml;se ju gjeni q&euml; OmegaT &euml;sht&euml; i dobish&euml;m, ju jeni t&euml; mir&euml; se ardhur t&euml; kontaktoni ekipin e zhvillimit dhe t&euml; b&euml;ni nj&euml; donacion. Sidoqof&euml;t, projekti q&euml;ndron mbi mbijetes&euml;n dhe t&euml; p&euml;rparohet m&euml; tep&euml;r n&euml; shfryt&euml;zuesit e OmegaT duke ofruar p&euml;rkrahje nj&euml; format tjera nga kontributet financiare. </p>


			 
<p>Projekti OmegaT-s&euml; do t&euml; p&euml;rfitonte p&euml;rkrahje m&euml; t&euml; madhe nga vullnetar&euml;t n&euml; gati t&euml; gjitha fushat. Megjithat&euml; shum&euml; shfryt&euml;zuesit jan&euml; n&euml; dijeni p&euml;r k&euml;t&euml;,
reaksioni i tyre shpesh &euml;sht&euml; "Po un&euml; nuk mund t&euml; programoj!". Programimi padyshim &euml;sht&euml; funksioni m&euml; i r&euml;nd&euml;sish&euml;m, dhe pa programim, nuk ka program. Por programimi nuk &euml;sht&euml; e vetmja pun&euml; q&euml; duhet t&euml; b&euml;het.
N&euml; vijim &euml;sht&euml; nj&euml; list&euml; e fushave kur vullnetar&euml;t tjer&euml; jan&euml; m&euml; tep&euml;r se t&euml; mir&euml; se ardhur!</p>

 
<h3>Autorimi i dokumentacionit </h3>


<p>Dokumentimi &euml;sht&euml; shum&euml; i r&euml;nd&euml;sish&euml;m. Shumica e leximit tuaj do t&euml; jet&euml; p&euml;rkthyesit q&euml; e kan&euml; p&euml;rkthyer shumic&euml;n e dokumentacionit t&euml; shfryt&euml;zuesit. A keni konsideruar q&euml; t&euml; shkruani vet disa dokumentacione t&euml; shfryt&euml;zuesit? Kjo &euml;sht&euml; nj&euml; hap&euml;s-syri real!</p>


<h3>Lokalizimi </h3>


<p>Faleminderim p&euml;r pun&euml;n e p&euml;rkthyes&euml;ve n&euml; t&euml; kaluar&euml;n, nd&euml;rfaq&euml;si i shfryt&euml;zuesit dhe/ose tekstet e Ndihm&euml;s q&euml; jan&euml; p&euml;rkthyer n&euml; disa gjuh&euml;. Kjo n&euml;nkupton se kan&euml; mbetur edhe ca mij&euml;ra! Lokalizimi i 
OmegaT-s&euml; n&euml; gjuh&euml;t tjera gjithashtu &euml;sht&euml; nj&euml; detyr&euml; n&euml; vazhdim e sip&euml;r, pasi q&euml; do t&euml; shtohen ve&ccedil;ori dhe funksione t&euml; reja koh&euml; pas kohe. Shiko <a href="translation-info.html">k&euml;tu</a> p&euml;r detajet se &ccedil;ka &euml;sht&euml; p&euml;rfshir&euml; n&euml;  lokalizimin/p&euml;rkthimin e OmegaT-s&euml;. </p>


<h3>Testimi </h3>


<p>Nj&euml; nga gj&euml;rat m&euml; t&euml; dobishme q&euml; shfryt&euml;zuesit e  OmegaT-s&euml; mund t&euml; b&euml;jn&euml;... &euml;sht&euml; q&euml; t&euml; p&euml;rdorin OmegaT-n&euml;. Dhe kur ata t&euml; gjejn&euml; gj&euml;ra q&euml; nuk ecin, ose mungesa n&euml; dokumentacion, t&euml; na tregojn&euml; p&euml;r ato.</p>


<p></p>

<h3>Programimi (Java) </h3>


<p>OmegaT &euml;sht&euml; shkruar n&euml; Java. N&euml;se jeni programer dhe ndodh q&euml; ju t&euml; njihni Java-n, ne do t&euml; donim t&euml; d&euml;gjojm&euml; nga ju. N&euml;se jo...</p>

<h3>Programimi (jo Java) </h3>


<p>... nuk &euml;sht&euml; e kuptueshme n&euml; rastin q&euml; t&euml;r&euml; programimi t&euml; duhet t&euml; b&euml;hen t&euml;r&euml;sisht n&euml; Java. N&euml;se ju mund t&euml; programoni n&euml; ndonj&euml; gjuh&euml; tjet&euml;r, ju mudn t&euml; shkruani kodin q&euml; t&euml; p&euml;rkrahet aplikacioni b&euml;rtham&euml;. Kod i till&euml; ndim&euml;s tanim&euml; ka qen&euml; i shkruar n&euml; Star Basic dhe Tcl/Tk, p&euml;r dallim.
Por un&euml; nuk mund t&euml; programoj fare, Kam d&euml;gjuar t&euml; thon&euml;I. Paj, a keni menduar t&euml; m&euml;soni? N&euml;se ju tanim&euml; jeni arsyesh&euml;m t&euml; njohur me kompjuter&euml;t n&euml; p&euml;rgjith&euml;si dhe keni p&euml;rzgjedhur drejp&euml;rs&euml;drejti nj&euml; gjuh&euml; skriptuese si&ccedil; &euml;sht&euml; Tcl/Tk,
ju mund t&euml; m&euml;soni veten mjaft ashtu q&euml; t&euml; jeni n&euml; gjendje t&euml; shkruani skripte t&euml; thjeshta por t&euml; dobishme brenda disa jav&euml;ve. Zhvillimi i Vazhduesh&euml;m Profesional &euml;sht&euml; fjala moderne te tanishme! </p>


<h3>Publiciteti </h3>


<p>A keni shkruar shkruar ndonj&euml; her&euml; ndonj&euml; artikull p&euml;r zhurnalin e shoqat&euml;s suaj profesionale? N&euml;se jo, pse nuk e shkruani nj&euml; artikul n&euml; shfryt&euml;zimin e OmegaT-s&euml;?</p>


</div>


