<div class="container">
	
<h2>Resurset tjera t&euml;  OmegaT-s&euml; </h2>





	
<h3>Veglat</h3>





	
<table>




  <tbody>




    

	

		

    <tr>




      <td><a href="/files/aligner.zip">"Aligner" aligner utility</a></td>





		<td>Kontribuuar nga Dmitri Gabinski. Shkruar n&euml; Python.</td>




		</tr>


    <tr>



      <td><a href="/files/bligner042.zip">"Bligner" aligner utility</a></td>



      <td>Kontribuuar nga Didier Briel. Shkruar n&euml; Python/Perl.</td>



    </tr>



    






    <tr>




      <td><a href="/files/TMXMerger-1.0.jar">TMXMerger</a></td>




      <td>Java skript komand&euml;-linje p&euml;r bashkimin e dy ose m&euml; tep&euml;r TMX skedar&euml;ve. Kontribuuar nga Henry Pijffers.</td>




    </tr>




    <tr>




      <td><a href="/files/TMXCleaner-1.0.RC1.jar">TMXCleaner</a></td>




      <td>Java skript komand&euml;-linje p&euml;r heqjen "superfluous"
translation units from a TMX file: deletes all TUs without target
segment or in which the target segment is identical to the source
segment. Kontribuuar nga Henry Pijffers.</td>




    </tr>









    <tr>




      <td><a href="/files/omegatk/extspell-1.1.3.zip">Extspell</a></td>





		<td>Extspell kontrollues shkrimi i jasht&euml;m. Kontribuuar nga Marc Prior. K&euml;rkon tcl/tk dhe Aspell (t&euml; dyja falas, t&euml; gjitha  platformat).</td>




    </tr>








    <tr>



      <td><a href="/files/omegatk/tkount_1.3.zip">TKount</a></td>




		<td>TKount veg&euml;l numrimi t&euml; teksit. Kontribuuar nga Marc Prior. Requires tcl/tk, Abiword dhe pdftotext. &Euml;sht&euml; testuar n&euml; Linux.</td>



    </tr>





    <tr>




      <td><a href="/files/WF.zip">Wordfast TMX file converter</a></td>





		<td>Konverton memoriet n&euml; formatin TMX t&euml; gjeneruar p&euml;r t&euml; formuar q&euml; mund t&euml; lexohet nga OmegaT. Kontribuuar nga Dmitri
Gabinski. </td>




    </tr>



    <tr>



      <td><a href="/files/strip_it">stripIT macro</a></td>



      <td>Makro p&euml;r heqjen e tagjeve t&euml; brendshme t&euml; TMX skedar&euml;ve. <span style="font-style: italic;">Nj&euml; nga tarashigimi e OmegaT skedar&euml;ve; OmegaT tani eksporton TMX skedar&euml; ,e ose pa tagje t&euml; brendshme.</span> Kontribuuar nga Sonja Tomaskovic.&nbsp;</td>



    </tr>



    <tr>



      <td><a href="/files/OOoSegMacros-v0.3.txt">OpenOffice.org
			makrot e segmentimit</a></td>



      <td>Aft&euml;so  OmegaT p&euml;r t&euml; segmentuar n&euml; fjali n&euml; vet&euml; t&euml; paragraf&euml;ve.  <span style="font-style: italic;">Vet&euml;m p&euml;r referenc&euml;; ky funksion tani &euml;sht&euml; i ofruar provided brenda OmegaT-s&euml;.</span>&nbsp;Kontribuuar nga Benjamin Siband. </td>



    </tr>



    <tr>



      <td><a href="/files/OOoSegMacros-v0.3-README.txt">ReadMe</a></td>



      <td>P&euml;rshkrimi i Benjamin Siband's makrot e segmentimit.</td>



    </tr>





		
  
  
  
  
  </tbody>
</table>





	
<h3>Resurset e ndryshme</h3>





	
<table>




  <tbody>




    <tr>

      <td><a href="../training/documentation/translation_memory_training_course.zip">Kurse trajnimi</a> </td>

      <td>Kurse trajnimi p&euml;r OmegaT. P&euml;rmbajn&euml; nj&euml; model t&euml; doracakut t&euml; student&euml;ve me instruksionet p&euml;r trajnuesit p&euml;r adaptim, dhe shembuj resursesh .</td>

    </tr>

    <tr>





		<td><a href="/files/icons.zip">Ikona</a></td>





		<td>P&euml;rzgjedhje e ikonave alternative p&euml;r tu shfryt&euml;zuar me OmegaT.</td>




    </tr>





	<tr>




	<td><a href="/files/sample_texts_1.0.zip">Shembuj tekstesh</a></td>





		<td>P&euml;r testim dhe demostrim t&euml; OmegaT-s&euml;.</td>





	</tr>





  
  
  
  
  </tbody>
</table>





  </div>





	
