<div class="container">
		
<h2>Software de terceiros</h2>

<h3>Software de terceiros para usar con OmegaT</h3>



<table>
	<tbody>  
		<tr>

      <td><a href="howtos/spelling.html#repositories">Dicionarios ortogr&aacute;ficos</a></td>

      <td>Repositorios en li&ntilde;a de dicionarios ortogr&aacute;ficos para usar con OmegaT.</td>

		</tr>

		<tr>

      <td><a href="http://openoffice.org/">OpenOffice.org</a><br/><a href="http://www.libreoffice.org/">Libre Office</a></td>

      <td>Alternativas libres (compatibles) a Microsoft Office.</td>

  </tr>

    <tr>
      <td><a href="http://okapi.opentag.com">Okapi Framework</a></td>
      <td>Un conxunto de programas completo para preparar os ficheiros para a s&uacute;a traduci&oacute;n cunha ferramenta de traduci&oacute;n asistida. Permite que varios tipos de formatos de ficheiro que non son admitidos de forma nativa por OmegaT poidan ser traducidos. Hai un titorial detallado dispo&ntilde;ible. </td>
    </tr>
    <tr>
      <td><a href="http://sourceforge.net/projects/bitext2tmx">bitext2tmx</a></td>

      <td>Ferramenta de ali&ntilde;amento que permite crear memorias de traduci&oacute;n a partir de textos orixinais e as s&uacute;as traduci&oacute;ns.</td>
    </tr>

    <tr>
      <td><a href="http://www.glossum.com/omegat">Glossum</a></td>
      <td>Unha ferramenta de xesti&oacute;n de dicionarios en li&ntilde;a que se integra con OmegaT </td>
    </tr>

    <tr>
      <td><a href="http://sourceforge.net/projects/aligner">LF Aligner</a></td>

      <td>Ferramenta de ali&ntilde;amento a trav&eacute;s de li&ntilde;a de comandos que permite crear memorias de traduci&oacute;n a partir de textos orixinais e as s&uacute;as traduci&oacute;ns.</td>
    </tr>
      <tr>

      <td><a href="http://www.leuce.com/autoit/">Scripts e procedementos de Samuel Murray</a></td>
      <td>Descrici&oacute;ns e enlaces aos scripts e procedementos de Samuel Murray. A maior&iacute;a destes scripts requiren MS Windows, mais alg&uacute;ns procedementos poden funcionar noutras plataformas.<br/>Os scripts e procedementos est&aacute;n dispo&ntilde;ibles para permitirlle:<br/>- Saltar segmentos que conte&ntilde;en un determinado xogo de caracteres<br/>- Extraer todo o texto de orixe dos ficheiros do proxecto nun s&oacute; ficheiro de texto<br/>- Crear un ficheiro TMX que conte&ntilde;a todas as cadeas, con orixe e destino id&eacute;nticos<br/>- Engadir termos a un glosario mentres traduce con OmegaT<br/>- Engadir n&uacute;meros a todos os segmentos, fac&eacute;ndoos \xAB&uacute;nicos\xBB<br/>- Eliminar todo o texto a excepci&oacute;n das etiquetas, ou todas as etiquetas sen afectar ao resto do texto<br/>- Comprobar a ortograf&iacute;a (mediante varios procesos)</td>
    </tr>
  </tbody>
</table>

			</div>
		
