<div class="container">
			
<h2>O proxecto OmegaT e vostede</h2>


			
<p>OmegaT non &eacute; s&oacute; un produto, &eacute; un apaixonante proxecto do cal pode ser parte.</p>

<p> OmegaT &eacute; software libre. Iso significa que os usuarios como vostede son libres de descargalo e usalo con moi poucas restrici&oacute;ns. Tam&eacute;n &eacute; libre de copialo e pasarllo a outra xente.</p>


			 
<p>OmegaT &eacute; software de c&oacute;digo aberto. Iso significa que pode modificar OmegaT para adaptalo &aacute;s s&uacute;as necesidades se as&iacute; o desexa. Para os defensores do software libre, esta liberdade &eacute; a&iacute;nda m&aacute;is importante que o feito de non ter que pagar nada.</p>


			 
<p>O proxecto de OmegaT beneficiar&iacute;ase de un maior apoio por parte de usuarios de todo o mundo. Inda que moitos usuarios son conscientes disto, a reacci&oacute;n habitual &eacute; \xABNon sei programar!\xBB Programar &eacute; sen lugar a d&uacute;bidas a tarefa m&aacute;is importante, e sen a programaci&oacute;n non hai programa. Pero programar non &eacute; o &uacute;nico traballo que debe realizarse. A continuaci&oacute;n ten unha lista de &aacute;reas na que ser&iacute;an benvidos m&aacute;is voluntarios!</p>

 
<h3>Creaci&oacute;n de documentaci&oacute;n </h3>


<p>A documentaci&oacute;n &eacute; moi importante. Moitas das persoas que est&aacute;n lendo isto ser&aacute;n tradutores que ter&aacute;n lido moitos documentos de usuario. Pensou algunha vez en crear documentos de usuario? Cambiar&aacute; a s&uacute;a percepci&oacute;n!</p>


<h3>Localizaci&oacute;n </h3>


<p>Grazas ao traballo de tradutores no pasado, a interface de usuario de OmegaT e o seu manual foron traducidos a varios idiomas. Iso significa que s&oacute; faltan uns cantos miles! Localizar OmegaT a outros idiomas &eacute; unha tarefa continua, xa que novas caracter&iacute;sticas e funci&oacute;ns son engadidas a OmegaT constantemente. Lea a <a href="howtos/localizing_omegat.php">Gu&iacute;a de localizaci&oacute;n de OmegaT</a> para m&aacute;is informaci&oacute;n sobre localizar OmegaT. </p>


<h3>Facer probas </h3>


<p>Unha das cousas m&aacute;is &uacute;tiles que poden facer os usuarios de OmegaT &eacute;... usar OmegaT e informarnos cando atopan cousas que non funcionan, ou diferencias na documentaci&oacute;n.</p>


<p></p>

<h3>Programar (Java) </h3>


<p>OmegaT est&aacute; escrito en Java. Se &eacute; un programador con co&ntilde;ecementos de Java, gustar&iacute;anos contactar con vostede. Se non...</p>

<h3>Programar (sen Java) </h3>


<p>... non significa que toda a programaci&oacute;n te&ntilde;a que ser realizada en Java. Se pode programar noutro idioma, pode escribir c&oacute;digo para apoiar o programa. Este c&oacute;digo complementario xa se escribiu en Star Basic e Tcl/Tk, por exemplo. Podo escoitar como di que non pode programar en absoluto. Considerou aprender? Se xa est&aacute; familiarizado cos ordenadores e escolle unha linguaxe de procesamento de scripts directa como Tcl/Tk, poder&iacute;a aprender por si mesmo nunhas poucas semanas o suficiente para escribir scripts simples pero &uacute;tiles. O desenvolvemento profesional continuo &eacute; a actual expresi&oacute;n de moda! </p>


<h3>Publicidade </h3>


<p>Escribiu algunha vez un artigo para a revista da s&uacute;a asociaci&oacute;n profesional? Se non, por que non escribe un artigo sobre usar OmegaT?</p>


<h3>Doaz&oacute;ns</h3>

<p>Se cre que OmegaT &eacute; &uacute;til e lle gustar&iacute;a expresar a s&uacute;a gratitude realizando unha doaz&oacute;n, vaia &aacute; <a href="http://sourceforge.net/projects/omegat/">p&aacute;xina de OmegaT en SourceForge</a> e faga clic en \xABDoar\xBB. </p>


</div>


