<div class="container">
		
<h2>Filosof&iacute;a</h2>

<h3>A filosof&iacute;a do c&oacute;digo aberto</h3>

<p>OmegaT &eacute; un programa e proxecto de c&oacute;digo aberto. Isto significa que o c&oacute;digo fonte de OmegaT est&aacute; dispo&ntilde;ible de forma libre e gratu&iacute;ta, e que a licenza de OmegaT d&aacute; &aacute;s persoas que o usan unha liberdade considerable para usalo. No s&oacute; poden usalo sen custe alg&uacute;n, as persoas que o usan tam&eacute;n poden realizar copias del e distribu&iacute;las. </p>

<p>Un aspecto importante desta liberdade &eacute; que os as persoas que o usan poden modificar o c&oacute;digo do programa. Para o movemento do c&oacute;digo aberto, a liberdade dos usuarios para cambiar o programa para adaptalo &aacute;s s&uacute;as necesidades &eacute; m&aacute;is importante que o feito de que non te&ntilde;an que pagar por el. Isto descr&iacute;bese como \xABtan libre como na expresi&oacute;n\xBB, en contraste con \xABtan gratu&iacute;to como a cervexa gratis\xBB.</p><br/>

<h3>A filosof&iacute;a do proxecto OmegaT</h3>

<p>P&oacute;dese atopar o mesmo esp&iacute;rito no proxecto OmegaT. As persoas que o usan son libres de descargar e usar o programa. A cambio, son libres e incluso as animamos (inda que non est&aacute;n obrigadas de ningunha forma) a contribu&iacute;r ao proxecto. Como o fagan depende delas. Por exemplo, non hai nada que impida que un usuario escriba o seu propio manual de usuario ou faga un v&iacute;deo no que mostra OmegaT, e se o proxecto considera que &eacute; &uacute;til, &eacute; probable que o po&ntilde;a &aacute; disposici&oacute;n da comunidade de usuarios de OmegaT. Cando se trata de tarefas rutineiras, os voluntarios que traballan no proxecto de OmegaT te&ntilde;en tanta liberdade como for posible &aacute; hora de decidir como contribu&iacute;r. O actual coordinador do proxecto OmegaT describe esta pol&iacute;tica permisiva como unha \xABanarqu&iacute;a delegada\xBB.</p>

<p>Nalgunhas &aacute;reas &eacute; precisa unha certa coordinaci&oacute;n. Por exemplo, calquera persoa &eacute; libre de facer cambios no c&oacute;digo de OmegaT e enviar estes cambios ao equipo de desenvolvemento. Estes cambios s&oacute; ser&aacute;n inclu&iacute;dos se o equipo considera que son beneficiosos para os usuarios de OmegaT. Desta forma asegur&aacute;monos de que se protexen os intereses dos usuarios, o cal levou a que OmegaT ga&ntilde;ase a <a href="http://mac.softpedia.com/get/Word-Processing/OmegaT.shtml">garant&iacute;a \xAB100 % limpo\xBB da Softpedia</a>.</p><br/>

<h3>Desenvolvemento de OmegaT</h3>

<p>Coma no resto de &aacute;reas de OmegaT, o traballo de programaci&oacute;n real&iacute;zano persoas voluntarias e, seguindo a filosof&iacute;a do proxecto, o desenvolvemento e melloras que fan som&eacute;tense ao seu propio criterio. Con todo, as persoas que o usan te&ntilde;en unha marxe considerable para suxerir melloras e influ&iacute;r no curso que tomar&aacute; o desenvolvemento no futuro.</p>

<p>O primeiro lugar no que se pode facer isto &eacute; no <a href="{{ site.data.links.support }}">grupo de usuarios de OmegaT</a>. Este &eacute; o punto principal de comunicaci&oacute;n da comunidade de usuarios de OmegaT. Animamos &aacute;s persoas que son novas no uso de OmegaT a facer suxesti&oacute;ns nel. Un dos motivos polo que o facemos &eacute; porque &eacute; posible que a funci&oacute;n que desexan xa estea dispo&ntilde;ible, ou que non se poida introducir por alg&uacute;n motivo. &Eacute; posible que existan funci&oacute;ns ou soluci&oacute;ns alternativas que sexan adecuadas.</p>

<p>As discusi&oacute;ns t&eacute;cnicas detalladas sobre cambios deber&iacute;an realizarse directamente cos desenvolvedores de OmegaT. Existe unha <a href="https://lists.sourceforge.net/lists/listinfo/omegat-development">lista de correo de desenvolvedores</a> dedicada a esta finalidade.</p>

<p>Existe un procedemento definido para enviar propostas de cambio ou mellora de OmegaT ao equipo de desenvolvemento para a s&uacute;a avaliaci&oacute;n.  Desta forma podemos avaliar as m&uacute;ltiples suxesti&oacute;ns de forma m&aacute;is f&aacute;cil. Denominamos ao proxecto <a href="https://sourceforge.net/p/omegat/feature-requests/">\xABRFE\xBB (Petici&oacute;n de mellora dunha funci&oacute;n, polas s&uacute;as siglas en ingl&eacute;s) e se xestiona aqu&iacute;</a>.</p>

<p>Xa se te&ntilde;en realizado centos de RFE e moitas delas xa foron incorporadas. &Eacute; preciso ter en conta que enviar un RFE non implica que a funci&oacute;n ou mellora desexada se vaia incorporar de forma autom&aacute;tica. Se se adopta ou non depender&aacute; en primeiro lugar de se o equipo de desenvolvemento cre que &eacute; beneficiosa para OmegaT, e en segundo lugar, de se algunha das persoas que desenvolve est&aacute; disposta a traballar para inclu&iacute;la. </p>

<p>As persoas que desenvolven OmegaT, que son todas voluntarias, poden estar m&aacute;is dispostas a traballar nun RFE se o traballo est&aacute; financiado pola persoa que fai a solicitude. <a href="sponsorship.html">O patrocinio do desenvolvemento xa levou &aacute; inclusi&oacute;n de certas caracter&iacute;sticas.</a> Se desexa financiar o traballo para que se introduza unha caracter&iacute;stica, p&oacute;&ntilde;ase en contacto co equipo de desenvolvemento en privado para discutilo. Tam&eacute;n &eacute; posible que se implementen en OmegaT desenvolvementos encargados a desenvolvedores externos &Eacute; preciso ter en conta que se aplican os mesmos principios que cos desenvolvementos gratu&iacute;tos: que os cambios deben ser beneficiosos para o programa e as persoas que o usan.</p>


</div>

