<div class="container">
	
<h2>Outros recursos de OmegaT</h2>

<h3>Complementos de OmegaT</h3>

<table>

  <tbody>

    <tr>

      <td><a href="http://sourceforge.net/projects/omegat-plugins/files/OmegaT-tokenizers/">Complemento de Tokenizers</a></td>

		<td>Permite o reco&ntilde;ecemento de formas flexivas en coincidencias parciais e resultados do glosario. Hai dispo&ntilde;ible <a href="./howtos/tokenizer.php">unha gu&iacute;a que describe o complemento de tokenizers</a>.</td>

    </tr>

    <tr>

      <td><a href="http://sourceforge.net/projects/omegat-plugins/files/OmegaT-LanguageTool/">Complemento LanguageTool</a></td>

		<td>Comproba se hai erros idiom&aacute;ticos (estilo, gram&aacute;tica, etc.)</td>

    </tr>

    <tr>

      <td><a href="http://sourceforge.net/projects/omegat-plugins/files/OmegaT-Scripting/">Complemento Scripting</a></td>

		<td>Permite a scripts externos acceder &aacute;s funcionalidades de OmegaT. (Non se debe confundir coa funcionalidade \xABExportar texto\xBB, que tam&eacute;n permite empregar scripts con OmegaT, pero dunha forma m&aacute;is b&aacute;sica.)</td>

    </tr>

    <tr>

      <td><a href="http://www.opentag.com/okapi/wiki/index.php?title=Okapi_Filters_Plugin_for_OmegaT">Complemento Okapi Filters</a></td>

		<td>Proporciona filtros para poder traballar con formatos de ficheiro adicionais, entre os que se incl&uacute;e o TTX de Trados.</td>

    </tr>


    <tr>

      <td><a href="http://wiki.apertium.org/wiki/Apertium-OmegaT">Complemento Apertium</a></td>

		<td>Integra a funcionalidade de traduci&oacute;n autom&aacute;tica de Apertium en OmegaT.</td>

    </tr>


  </tbody>

</table>

<p>Importante: para usar os complementos, &eacute; posible que te&ntilde;a que instalar unha versi&oacute;n m&aacute;is recente de OmegaT.    </p>



<h3>Utilidades</h3>

<table>

  <tbody>

    <tr>

      <td><a href="/files/aligner.zip">Utilidade de ali&ntilde;amento \xABAligner\xBB</a></td>

		<td>Escrita en Python. Contribuci&oacute;n de Dmitri Gabinski.</td>

		</tr>

<tr>

      <td><a href="http://www.bligner.org">Utilidade de ali&ntilde;amento \xABBligner\xBB</a></td>

      <td>Escrita en Python/Perl. Contribuci&oacute;n de Didier Briel.</td>

</tr>

    <tr>

      <td><a href="/files/TMXMerger.zip">TMXMerger</a></td>

<td>Un script de li&ntilde;a de comandos de Java para unir dous ou m&aacute;is ficheiros TMX. Contribuci&oacute;n de Henry Pijffers.</td>

    </tr>

    <tr>

      <td><a href="/files/TMXCleaner-1.0.RC1.zip">TMXCleaner</a></td>

      <td>Un script de li&ntilde;a de comandos de Java para borrar unidades de traduci&oacute;n \xABsuperfluas\xBB dun ficheiro TMX: borra todas as UT f&oacute;ra do segmento de destino ou que sexan id&eacute;nticas ao fragmento de orixe. Contribuci&oacute;n de Henry Pijffers.</td>

    </tr>

    <tr>

      <td><a href="/files/toxic.zip">Toxic</a></td>

		<td>Utilidade para converter ficheiros Trados TagEditor (TTX) a un formato intermedio, permitindo que se traduzan en OmegaT. Esta colecci&oacute;n de scripts pode ser &uacute;til para os creadores de scripts con co&ntilde;ecementos de tcl/tk. Recomendamos &oacute; resto de persoas que usan OmegaT empregar no seu lugar o <a href="http://www.opentag.com/okapi/wiki/index.php?title=Okapi_Filters_Plugin_for_OmegaT">Plugin Okapi Filters</a>. Toxic &eacute; unha contribuci&oacute;n de Marc Prior.</td>

    </tr>
    <tr>

      <td><a href="/files/toxic_windows.zip">Toxic para Windows</a></td>

		<td>Versi&oacute;n executable de Toxic para Windows.</td>

    </tr>
    <tr>

      <td><a href="/files/toxic_linux.zip">Toxic para Linux</a></td>

		<td>Versi&oacute;n de binario de Linux de Toxic.</td>

    </tr>

    <tr>

      <td><a href="/files/toxic_scripts.zip">Scripts Toxic</a></td>

		<td>Versi&oacute;n de scripts de Toxic. &Eacute; independente da plataforma, require tcl/tk.</td>

    </tr>

    <tr>

      <td><a href="../omegatk/stripper.zip">Stripper</a></td>

		<td>Un script para extraer texto de ficheiros de texto plano (por exemplo, de c&oacute;digo fonte de ordenador) para traducir co OmegaT. Require tcl/tk. Contribuci&oacute;n de Marc Prior.</td>

    </tr>

    <tr>

      <td><a href="../omegatk/tkount.zip">TKount</a></td>

		<td>Utilidade para contar textos TKount. Require tcl/tk, Abiword e pdftotext. Foi probado en Linux. Contribuci&oacute;n de Marc Prior.</td>

    </tr>

    <tr>

      <td><a href="../omegatk/ondiloto.zip">Ondiloto</a></td>

		<td>Ferramenta de busca en dicionario en li&ntilde;a. Require Linux, w3m e tcl/tk (ambos est&aacute;n normalmente incorporados en Linux). Contribuci&oacute;n de Marc Prior.</td>

    </tr>

    <tr>

      <td><a href="./howtos/priorview.html">Priorview</a></td>

		<td>Utilidade Tcl/tk que proporciona unha vista previa con formato dos textos traducidos. Contribuci&oacute;n de Marc Prior.</td>

    </tr>

    <tr>

      <td><a href="/files/WF.zip">Convertedor de ficheiros Wordfast TMX</a></td>

		<td>Convirte memorias de traduci&oacute;n do formato TMX xerado por Wordfast a un formato que OmegaT pode ler. Contribuci&oacute;n de Dmitri Gabinski. </td>

    </tr>

  </tbody>

</table>

<h3>Recursos varios</h3>
    
<table>

  <tbody>

    <tr>

      <td><a href="../training/translation_memory_training_course.zip">Curso de adestramento</a> </td>

      <td>Curso de adestramento de OmegaT. Consiste nun modelo de manual do estudante con instruci&oacute;ns de adaptaci&oacute;n para aprendices e recursos de mostra.</td>

    </tr>

    <tr>

		<td><a href="/files/icons.zip">Iconas</a></td>

		<td>Unha selecci&oacute;n de iconas alternativas para OmegaT.</td>

    </tr>

	<tr>

	<td><a href="/files/sample_texts_1.0.zip">Textos de mostra</a></td>

		<td>Para probar e mostrar OmegaT.</td>

    </tr>

  </tbody>
</table>

<h3>Recursos de localizaci&oacute;n</h3>
	
<table>

  <tbody>

    <tr>

		<td><a href="/files/tmx_repository.zip">Repositorio de TMX de localizaci&oacute;n</a></td>


		<td>Arquivos TMX de localizaci&oacute;ns da documentaci&oacute;n e a web de OmegaT para localizadores.</td>

    </tr>

    <tr>

      <td><a href="/files/omt_website.zip">Esta p&aacute;xina web</a></td>

      <td>Os arquivos desta p&aacute;xina web, nun pr&aacute;ctico paquete para aqueles que desexen localizala.</td>

    </tr>
  
  </tbody>

</table>

	</div>

